GopalSaraf/Practicals/PSDL/include/proc/pic18f47q43.inc
// Register: SPI2INTF
#define SPI2INTF SPI2INTF
SPI2INTF                                 equ 0097h
// bitfield definitions
SPI2INTF_TXUIF_POSN                      equ 0001h
SPI2INTF_TXUIF_POSITION                  equ 0001h
SPI2INTF_TXUIF_SIZE                      equ 0001h
SPI2INTF_TXUIF_LENGTH                    equ 0001h
SPI2INTF_TXUIF_MASK                      equ 0002h
SPI2INTF_RXOIF_POSN                      equ 0002h
SPI2INTF_RXOIF_POSITION                  equ 0002h
SPI2INTF_RXOIF_SIZE                      equ 0001h
SPI2INTF_RXOIF_LENGTH                    equ 0001h
SPI2INTF_RXOIF_MASK                      equ 0004h
SPI2INTF_EOSIF_POSN                      equ 0004h
SPI2INTF_EOSIF_POSITION                  equ 0004h
SPI2INTF_EOSIF_SIZE                      equ 0001h
SPI2INTF_EOSIF_LENGTH                    equ 0001h
SPI2INTF_EOSIF_MASK                      equ 0010h
SPI2INTF_SOSIF_POSN                      equ 0005h
SPI2INTF_SOSIF_POSITION                  equ 0005h
SPI2INTF_SOSIF_SIZE                      equ 0001h
SPI2INTF_SOSIF_LENGTH                    equ 0001h
SPI2INTF_SOSIF_MASK                      equ 0020h
SPI2INTF_TCZIF_POSN                      equ 0006h
SPI2INTF_TCZIF_POSITION                  equ 0006h
SPI2INTF_TCZIF_SIZE                      equ 0001h
SPI2INTF_TCZIF_LENGTH                    equ 0001h
SPI2INTF_TCZIF_MASK                      equ 0040h
SPI2INTF_SRMTIF_POSN                     equ 0007h
SPI2INTF_SRMTIF_POSITION                 equ 0007h
SPI2INTF_SRMTIF_SIZE                     equ 0001h
SPI2INTF_SRMTIF_LENGTH                   equ 0001h
SPI2INTF_SRMTIF_MASK                     equ 0080h
SPI2INTF_SPI2TXUIF_POSN                  equ 0001h
SPI2INTF_SPI2TXUIF_POSITION              equ 0001h
SPI2INTF_SPI2TXUIF_SIZE                  equ 0001h
SPI2INTF_SPI2TXUIF_LENGTH                equ 0001h
SPI2INTF_SPI2TXUIF_MASK                  equ 0002h
SPI2INTF_SPI2RXOIF_POSN                  equ 0002h
SPI2INTF_SPI2RXOIF_POSITION              equ 0002h
SPI2INTF_SPI2RXOIF_SIZE                  equ 0001h
SPI2INTF_SPI2RXOIF_LENGTH                equ 0001h
SPI2INTF_SPI2RXOIF_MASK                  equ 0004h
SPI2INTF_SPI2EOSIF_POSN                  equ 0004h
SPI2INTF_SPI2EOSIF_POSITION              equ 0004h
SPI2INTF_SPI2EOSIF_SIZE                  equ 0001h
SPI2INTF_SPI2EOSIF_LENGTH                equ 0001h
SPI2INTF_SPI2EOSIF_MASK                  equ 0010h
SPI2INTF_SPI2SOSIF_POSN                  equ 0005h
SPI2INTF_SPI2SOSIF_POSITION              equ 0005h
SPI2INTF_SPI2SOSIF_SIZE                  equ 0001h
SPI2INTF_SPI2SOSIF_LENGTH                equ 0001h
SPI2INTF_SPI2SOSIF_MASK                  equ 0020h
SPI2INTF_SPI2TCZIF_POSN                  equ 0006h
SPI2INTF_SPI2TCZIF_POSITION              equ 0006h
SPI2INTF_SPI2TCZIF_SIZE                  equ 0001h
SPI2INTF_SPI2TCZIF_LENGTH                equ 0001h
SPI2INTF_SPI2TCZIF_MASK                  equ 0040h
SPI2INTF_SPI2SRMTIF_POSN                 equ 0007h
SPI2INTF_SPI2SRMTIF_POSITION             equ 0007h
SPI2INTF_SPI2SRMTIF_SIZE                 equ 0001h
SPI2INTF_SPI2SRMTIF_LENGTH               equ 0001h
SPI2INTF_SPI2SRMTIF_MASK                 equ 0080h

// Register: SPI2INTE
#define SPI2INTE SPI2INTE
SPI2INTE                                 equ 0098h
// bitfield definitions
SPI2INTE_TXUIE_POSN                      equ 0001h
SPI2INTE_TXUIE_POSITION                  equ 0001h
SPI2INTE_TXUIE_SIZE                      equ 0001h
SPI2INTE_TXUIE_LENGTH                    equ 0001h
SPI2INTE_TXUIE_MASK                      equ 0002h
SPI2INTE_RXOIE_POSN                      equ 0002h
SPI2INTE_RXOIE_POSITION                  equ 0002h
SPI2INTE_RXOIE_SIZE                      equ 0001h
SPI2INTE_RXOIE_LENGTH                    equ 0001h
SPI2INTE_RXOIE_MASK                      equ 0004h
SPI2INTE_EOSIE_POSN                      equ 0004h
SPI2INTE_EOSIE_POSITION                  equ 0004h
SPI2INTE_EOSIE_SIZE                      equ 0001h
SPI2INTE_EOSIE_LENGTH                    equ 0001h
SPI2INTE_EOSIE_MASK                      equ 0010h
SPI2INTE_SOSIE_POSN                      equ 0005h
SPI2INTE_SOSIE_POSITION                  equ 0005h
SPI2INTE_SOSIE_SIZE                      equ 0001h
SPI2INTE_SOSIE_LENGTH                    equ 0001h
SPI2INTE_SOSIE_MASK                      equ 0020h
SPI2INTE_TCZIE_POSN                      equ 0006h
SPI2INTE_TCZIE_POSITION                  equ 0006h
SPI2INTE_TCZIE_SIZE                      equ 0001h
SPI2INTE_TCZIE_LENGTH                    equ 0001h
SPI2INTE_TCZIE_MASK                      equ 0040h
SPI2INTE_SRMTIE_POSN                     equ 0007h
SPI2INTE_SRMTIE_POSITION                 equ 0007h
SPI2INTE_SRMTIE_SIZE                     equ 0001h
SPI2INTE_SRMTIE_LENGTH                   equ 0001h
SPI2INTE_SRMTIE_MASK                     equ 0080h
SPI2INTE_SPI2TXUIE_POSN                  equ 0001h
SPI2INTE_SPI2TXUIE_POSITION              equ 0001h
SPI2INTE_SPI2TXUIE_SIZE                  equ 0001h
SPI2INTE_SPI2TXUIE_LENGTH                equ 0001h
SPI2INTE_SPI2TXUIE_MASK                  equ 0002h
SPI2INTE_SPI2RXOIE_POSN                  equ 0002h
SPI2INTE_SPI2RXOIE_POSITION              equ 0002h
SPI2INTE_SPI2RXOIE_SIZE                  equ 0001h
SPI2INTE_SPI2RXOIE_LENGTH                equ 0001h
SPI2INTE_SPI2RXOIE_MASK                  equ 0004h
SPI2INTE_SPI2EOSIE_POSN                  equ 0004h
SPI2INTE_SPI2EOSIE_POSITION              equ 0004h
SPI2INTE_SPI2EOSIE_SIZE                  equ 0001h
SPI2INTE_SPI2EOSIE_LENGTH                equ 0001h
SPI2INTE_SPI2EOSIE_MASK                  equ 0010h
SPI2INTE_SPI2SOSIE_POSN                  equ 0005h
SPI2INTE_SPI2SOSIE_POSITION              equ 0005h
SPI2INTE_SPI2SOSIE_SIZE                  equ 0001h
SPI2INTE_SPI2SOSIE_LENGTH                equ 0001h
SPI2INTE_SPI2SOSIE_MASK                  equ 0020h
SPI2INTE_SPI2TCZIE_POSN                  equ 0006h
SPI2INTE_SPI2TCZIE_POSITION              equ 0006h
SPI2INTE_SPI2TCZIE_SIZE                  equ 0001h
SPI2INTE_SPI2TCZIE_LENGTH                equ 0001h
SPI2INTE_SPI2TCZIE_MASK                  equ 0040h
SPI2INTE_SPI2SRMTIE_POSN                 equ 0007h
SPI2INTE_SPI2SRMTIE_POSITION             equ 0007h
SPI2INTE_SPI2SRMTIE_SIZE                 equ 0001h
SPI2INTE_SPI2SRMTIE_LENGTH               equ 0001h
SPI2INTE_SPI2SRMTIE_MASK                 equ 0080h

// Register: SPI2CLK
#define SPI2CLK SPI2CLK
SPI2CLK                                  equ 0099h
// bitfield definitions
SPI2CLK_CLKSEL_POSN                      equ 0000h
SPI2CLK_CLKSEL_POSITION                  equ 0000h
SPI2CLK_CLKSEL_SIZE                      equ 0008h
SPI2CLK_CLKSEL_LENGTH                    equ 0008h
SPI2CLK_CLKSEL_MASK                      equ 00FFh
SPI2CLK_CLKSEL0_POSN                     equ 0000h
SPI2CLK_CLKSEL0_POSITION                 equ 0000h
SPI2CLK_CLKSEL0_SIZE                     equ 0001h
SPI2CLK_CLKSEL0_LENGTH                   equ 0001h
SPI2CLK_CLKSEL0_MASK                     equ 0001h
SPI2CLK_CLKSEL1_POSN                     equ 0001h
SPI2CLK_CLKSEL1_POSITION                 equ 0001h
SPI2CLK_CLKSEL1_SIZE                     equ 0001h
SPI2CLK_CLKSEL1_LENGTH                   equ 0001h
SPI2CLK_CLKSEL1_MASK                     equ 0002h
SPI2CLK_CLKSEL2_POSN                     equ 0002h
SPI2CLK_CLKSEL2_POSITION                 equ 0002h
SPI2CLK_CLKSEL2_SIZE                     equ 0001h
SPI2CLK_CLKSEL2_LENGTH                   equ 0001h
SPI2CLK_CLKSEL2_MASK                     equ 0004h
SPI2CLK_CLKSEL3_POSN                     equ 0003h
SPI2CLK_CLKSEL3_POSITION                 equ 0003h
SPI2CLK_CLKSEL3_SIZE                     equ 0001h
SPI2CLK_CLKSEL3_LENGTH                   equ 0001h
SPI2CLK_CLKSEL3_MASK                     equ 0008h
SPI2CLK_CLKSEL4_POSN                     equ 0004h
SPI2CLK_CLKSEL4_POSITION                 equ 0004h
SPI2CLK_CLKSEL4_SIZE                     equ 0001h
SPI2CLK_CLKSEL4_LENGTH                   equ 0001h
SPI2CLK_CLKSEL4_MASK                     equ 0010h
SPI2CLK_SPI2CLKSEL_POSN                  equ 0000h
SPI2CLK_SPI2CLKSEL_POSITION              equ 0000h
SPI2CLK_SPI2CLKSEL_SIZE                  equ 0008h
SPI2CLK_SPI2CLKSEL_LENGTH                equ 0008h
SPI2CLK_SPI2CLKSEL_MASK                  equ 00FFh
SPI2CLK_SPI2CLKSEL0_POSN                 equ 0000h
SPI2CLK_SPI2CLKSEL0_POSITION             equ 0000h
SPI2CLK_SPI2CLKSEL0_SIZE                 equ 0001h
SPI2CLK_SPI2CLKSEL0_LENGTH               equ 0001h
SPI2CLK_SPI2CLKSEL0_MASK                 equ 0001h
SPI2CLK_SPI2CLKSEL1_POSN                 equ 0001h
SPI2CLK_SPI2CLKSEL1_POSITION             equ 0001h
SPI2CLK_SPI2CLKSEL1_SIZE                 equ 0001h
SPI2CLK_SPI2CLKSEL1_LENGTH               equ 0001h
SPI2CLK_SPI2CLKSEL1_MASK                 equ 0002h
SPI2CLK_SPI2CLKSEL2_POSN                 equ 0002h
SPI2CLK_SPI2CLKSEL2_POSITION             equ 0002h
SPI2CLK_SPI2CLKSEL2_SIZE                 equ 0001h
SPI2CLK_SPI2CLKSEL2_LENGTH               equ 0001h
SPI2CLK_SPI2CLKSEL2_MASK                 equ 0004h
SPI2CLK_SPI2CLKSEL3_POSN                 equ 0003h
SPI2CLK_SPI2CLKSEL3_POSITION             equ 0003h
SPI2CLK_SPI2CLKSEL3_SIZE                 equ 0001h
SPI2CLK_SPI2CLKSEL3_LENGTH               equ 0001h
SPI2CLK_SPI2CLKSEL3_MASK                 equ 0008h
SPI2CLK_SPI2CLKSEL4_POSN                 equ 0004h
SPI2CLK_SPI2CLKSEL4_POSITION             equ 0004h
SPI2CLK_SPI2CLKSEL4_SIZE                 equ 0001h
SPI2CLK_SPI2CLKSEL4_LENGTH               equ 0001h
SPI2CLK_SPI2CLKSEL4_MASK                 equ 0010h

// Register: ACTCON
#define ACTCON ACTCON
ACTCON                                   equ 00ACh
// bitfield definitions
ACTCON_ORS_POSN                          equ 0001h
ACTCON_ORS_POSITION                      equ 0001h
ACTCON_ORS_SIZE                          equ 0001h
ACTCON_ORS_LENGTH                        equ 0001h
ACTCON_ORS_MASK                          equ 0002h
ACTCON_LOCK_POSN                         equ 0003h
ACTCON_LOCK_POSITION                     equ 0003h
ACTCON_LOCK_SIZE                         equ 0001h
ACTCON_LOCK_LENGTH                       equ 0001h
ACTCON_LOCK_MASK                         equ 0008h
ACTCON_UD_POSN                           equ 0006h
ACTCON_UD_POSITION                       equ 0006h
ACTCON_UD_SIZE                           equ 0001h
ACTCON_UD_LENGTH                         equ 0001h
ACTCON_UD_MASK                           equ 0040h
ACTCON_EN_POSN                           equ 0007h
ACTCON_EN_POSITION                       equ 0007h
ACTCON_EN_SIZE                           equ 0001h
ACTCON_EN_LENGTH                         equ 0001h
ACTCON_EN_MASK                           equ 0080h
ACTCON_ACTORS_POSN                       equ 0001h
ACTCON_ACTORS_POSITION                   equ 0001h
ACTCON_ACTORS_SIZE                       equ 0001h
ACTCON_ACTORS_LENGTH                     equ 0001h
ACTCON_ACTORS_MASK                       equ 0002h
ACTCON_ACTLOCK_POSN                      equ 0003h
ACTCON_ACTLOCK_POSITION                  equ 0003h
ACTCON_ACTLOCK_SIZE                      equ 0001h
ACTCON_ACTLOCK_LENGTH                    equ 0001h
ACTCON_ACTLOCK_MASK                      equ 0008h
ACTCON_ACTUD_POSN                        equ 0006h
ACTCON_ACTUD_POSITION                    equ 0006h
ACTCON_ACTUD_SIZE                        equ 0001h
ACTCON_ACTUD_LENGTH                      equ 0001h
ACTCON_ACTUD_MASK                        equ 0040h
ACTCON_ACTEN_POSN                        equ 0007h
ACTCON_ACTEN_POSITION                    equ 0007h
ACTCON_ACTEN_SIZE                        equ 0001h
ACTCON_ACTEN_LENGTH                      equ 0001h
ACTCON_ACTEN_MASK                        equ 0080h

// Register: OSCCON1
#define OSCCON1 OSCCON1
OSCCON1                                  equ 00ADh
// bitfield definitions
OSCCON1_NDIV_POSN                        equ 0000h
OSCCON1_NDIV_POSITION                    equ 0000h
OSCCON1_NDIV_SIZE                        equ 0004h
OSCCON1_NDIV_LENGTH                      equ 0004h
OSCCON1_NDIV_MASK                        equ 000Fh
OSCCON1_NOSC_POSN                        equ 0004h
OSCCON1_NOSC_POSITION                    equ 0004h
OSCCON1_NOSC_SIZE                        equ 0003h
OSCCON1_NOSC_LENGTH                      equ 0003h
OSCCON1_NOSC_MASK                        equ 0070h
OSCCON1_NDIV0_POSN                       equ 0000h
OSCCON1_NDIV0_POSITION                   equ 0000h
OSCCON1_NDIV0_SIZE                       equ 0001h
OSCCON1_NDIV0_LENGTH                     equ 0001h
OSCCON1_NDIV0_MASK                       equ 0001h
OSCCON1_NDIV1_POSN                       equ 0001h
OSCCON1_NDIV1_POSITION                   equ 0001h
OSCCON1_NDIV1_SIZE                       equ 0001h
OSCCON1_NDIV1_LENGTH                     equ 0001h
OSCCON1_NDIV1_MASK                       equ 0002h
OSCCON1_NDIV2_POSN                       equ 0002h
OSCCON1_NDIV2_POSITION                   equ 0002h
OSCCON1_NDIV2_SIZE                       equ 0001h
OSCCON1_NDIV2_LENGTH                     equ 0001h
OSCCON1_NDIV2_MASK                       equ 0004h
OSCCON1_NDIV3_POSN                       equ 0003h
OSCCON1_NDIV3_POSITION                   equ 0003h
OSCCON1_NDIV3_SIZE                       equ 0001h
OSCCON1_NDIV3_LENGTH                     equ 0001h
OSCCON1_NDIV3_MASK                       equ 0008h
OSCCON1_NOSC0_POSN                       equ 0004h
OSCCON1_NOSC0_POSITION                   equ 0004h
OSCCON1_NOSC0_SIZE                       equ 0001h
OSCCON1_NOSC0_LENGTH                     equ 0001h
OSCCON1_NOSC0_MASK                       equ 0010h
OSCCON1_NOSC1_POSN                       equ 0005h
OSCCON1_NOSC1_POSITION                   equ 0005h
OSCCON1_NOSC1_SIZE                       equ 0001h
OSCCON1_NOSC1_LENGTH                     equ 0001h
OSCCON1_NOSC1_MASK                       equ 0020h
OSCCON1_NOSC2_POSN                       equ 0006h
OSCCON1_NOSC2_POSITION                   equ 0006h
OSCCON1_NOSC2_SIZE                       equ 0001h
OSCCON1_NOSC2_LENGTH                     equ 0001h
OSCCON1_NOSC2_MASK                       equ 0040h

// Register: OSCCON2
#define OSCCON2 OSCCON2
OSCCON2                                  equ 00AEh
// bitfield definitions
OSCCON2_CDIV_POSN                        equ 0000h
OSCCON2_CDIV_POSITION                    equ 0000h
OSCCON2_CDIV_SIZE                        equ 0004h
OSCCON2_CDIV_LENGTH                      equ 0004h
OSCCON2_CDIV_MASK                        equ 000Fh
OSCCON2_COSC_POSN                        equ 0004h
OSCCON2_COSC_POSITION                    equ 0004h
OSCCON2_COSC_SIZE                        equ 0003h
OSCCON2_COSC_LENGTH                      equ 0003h
OSCCON2_COSC_MASK                        equ 0070h
OSCCON2_CDIV0_POSN                       equ 0000h
OSCCON2_CDIV0_POSITION                   equ 0000h
OSCCON2_CDIV0_SIZE                       equ 0001h
OSCCON2_CDIV0_LENGTH                     equ 0001h
OSCCON2_CDIV0_MASK                       equ 0001h
OSCCON2_CDIV1_POSN                       equ 0001h
OSCCON2_CDIV1_POSITION                   equ 0001h
OSCCON2_CDIV1_SIZE                       equ 0001h
OSCCON2_CDIV1_LENGTH                     equ 0001h
OSCCON2_CDIV1_MASK                       equ 0002h
OSCCON2_CDIV2_POSN                       equ 0002h
OSCCON2_CDIV2_POSITION                   equ 0002h
OSCCON2_CDIV2_SIZE                       equ 0001h
OSCCON2_CDIV2_LENGTH                     equ 0001h
OSCCON2_CDIV2_MASK                       equ 0004h
OSCCON2_CDIV3_POSN                       equ 0003h
OSCCON2_CDIV3_POSITION                   equ 0003h
OSCCON2_CDIV3_SIZE                       equ 0001h
OSCCON2_CDIV3_LENGTH                     equ 0001h
OSCCON2_CDIV3_MASK                       equ 0008h
OSCCON2_COSC0_POSN                       equ 0004h
OSCCON2_COSC0_POSITION                   equ 0004h
OSCCON2_COSC0_SIZE                       equ 0001h
OSCCON2_COSC0_LENGTH                     equ 0001h
OSCCON2_COSC0_MASK                       equ 0010h
OSCCON2_COSC1_POSN                       equ 0005h
OSCCON2_COSC1_POSITION                   equ 0005h
OSCCON2_COSC1_SIZE                       equ 0001h
OSCCON2_COSC1_LENGTH                     equ 0001h
OSCCON2_COSC1_MASK                       equ 0020h
OSCCON2_COSC2_POSN                       equ 0006h
OSCCON2_COSC2_POSITION                   equ 0006h
OSCCON2_COSC2_SIZE                       equ 0001h
OSCCON2_COSC2_LENGTH                     equ 0001h
OSCCON2_COSC2_MASK                       equ 0040h

// Register: OSCCON3
#define OSCCON3 OSCCON3
OSCCON3                                  equ 00AFh
// bitfield definitions
OSCCON3_NOSCR_POSN                       equ 0003h
OSCCON3_NOSCR_POSITION                   equ 0003h
OSCCON3_NOSCR_SIZE                       equ 0001h
OSCCON3_NOSCR_LENGTH                     equ 0001h
OSCCON3_NOSCR_MASK                       equ 0008h
OSCCON3_ORDY_POSN                        equ 0004h
OSCCON3_ORDY_POSITION                    equ 0004h
OSCCON3_ORDY_SIZE                        equ 0001h
OSCCON3_ORDY_LENGTH                      equ 0001h
OSCCON3_ORDY_MASK                        equ 0010h
OSCCON3_SOSCPWR_POSN                     equ 0006h
OSCCON3_SOSCPWR_POSITION                 equ 0006h
OSCCON3_SOSCPWR_SIZE                     equ 0001h
OSCCON3_SOSCPWR_LENGTH                   equ 0001h
OSCCON3_SOSCPWR_MASK                     equ 0040h
OSCCON3_CSWHOLD_POSN                     equ 0007h
OSCCON3_CSWHOLD_POSITION                 equ 0007h
OSCCON3_CSWHOLD_SIZE                     equ 0001h
OSCCON3_CSWHOLD_LENGTH                   equ 0001h
OSCCON3_CSWHOLD_MASK                     equ 0080h

