GopalSaraf/Practicals/PSDL/include/proc/pic18f47q43.inc
// Register: DMA6PR
#define DMA6PR DMA6PR
DMA6PR                                   equ 00BBh
// bitfield definitions
DMA6PR_PR_POSN                           equ 0000h
DMA6PR_PR_POSITION                       equ 0000h
DMA6PR_PR_SIZE                           equ 0003h
DMA6PR_PR_LENGTH                         equ 0003h
DMA6PR_PR_MASK                           equ 0007h
DMA6PR_PR0_POSN                          equ 0000h
DMA6PR_PR0_POSITION                      equ 0000h
DMA6PR_PR0_SIZE                          equ 0001h
DMA6PR_PR0_LENGTH                        equ 0001h
DMA6PR_PR0_MASK                          equ 0001h
DMA6PR_PR1_POSN                          equ 0001h
DMA6PR_PR1_POSITION                      equ 0001h
DMA6PR_PR1_SIZE                          equ 0001h
DMA6PR_PR1_LENGTH                        equ 0001h
DMA6PR_PR1_MASK                          equ 0002h
DMA6PR_PR2_POSN                          equ 0002h
DMA6PR_PR2_POSITION                      equ 0002h
DMA6PR_PR2_SIZE                          equ 0001h
DMA6PR_PR2_LENGTH                        equ 0001h
DMA6PR_PR2_MASK                          equ 0004h
DMA6PR_DMA6PR_POSN                       equ 0000h
DMA6PR_DMA6PR_POSITION                   equ 0000h
DMA6PR_DMA6PR_SIZE                       equ 0003h
DMA6PR_DMA6PR_LENGTH                     equ 0003h
DMA6PR_DMA6PR_MASK                       equ 0007h
DMA6PR_DMA6PR0_POSN                      equ 0000h
DMA6PR_DMA6PR0_POSITION                  equ 0000h
DMA6PR_DMA6PR0_SIZE                      equ 0001h
DMA6PR_DMA6PR0_LENGTH                    equ 0001h
DMA6PR_DMA6PR0_MASK                      equ 0001h
DMA6PR_DMA6PR1_POSN                      equ 0001h
DMA6PR_DMA6PR1_POSITION                  equ 0001h
DMA6PR_DMA6PR1_SIZE                      equ 0001h
DMA6PR_DMA6PR1_LENGTH                    equ 0001h
DMA6PR_DMA6PR1_MASK                      equ 0002h
DMA6PR_DMA6PR2_POSN                      equ 0002h
DMA6PR_DMA6PR2_POSITION                  equ 0002h
DMA6PR_DMA6PR2_SIZE                      equ 0001h
DMA6PR_DMA6PR2_LENGTH                    equ 0001h
DMA6PR_DMA6PR2_MASK                      equ 0004h

// Register: MAINPR
#define MAINPR MAINPR
MAINPR                                   equ 00BEh
// bitfield definitions
MAINPR_PR_POSN                           equ 0000h
MAINPR_PR_POSITION                       equ 0000h
MAINPR_PR_SIZE                           equ 0003h
MAINPR_PR_LENGTH                         equ 0003h
MAINPR_PR_MASK                           equ 0007h
MAINPR_PR0_POSN                          equ 0000h
MAINPR_PR0_POSITION                      equ 0000h
MAINPR_PR0_SIZE                          equ 0001h
MAINPR_PR0_LENGTH                        equ 0001h
MAINPR_PR0_MASK                          equ 0001h
MAINPR_PR1_POSN                          equ 0001h
MAINPR_PR1_POSITION                      equ 0001h
MAINPR_PR1_SIZE                          equ 0001h
MAINPR_PR1_LENGTH                        equ 0001h
MAINPR_PR1_MASK                          equ 0002h
MAINPR_PR2_POSN                          equ 0002h
MAINPR_PR2_POSITION                      equ 0002h
MAINPR_PR2_SIZE                          equ 0001h
MAINPR_PR2_LENGTH                        equ 0001h
MAINPR_PR2_MASK                          equ 0004h
MAINPR_MAINPR_POSN                       equ 0000h
MAINPR_MAINPR_POSITION                   equ 0000h
MAINPR_MAINPR_SIZE                       equ 0003h
MAINPR_MAINPR_LENGTH                     equ 0003h
MAINPR_MAINPR_MASK                       equ 0007h
MAINPR_MAINPR0_POSN                      equ 0000h
MAINPR_MAINPR0_POSITION                  equ 0000h
MAINPR_MAINPR0_SIZE                      equ 0001h
MAINPR_MAINPR0_LENGTH                    equ 0001h
MAINPR_MAINPR0_MASK                      equ 0001h
MAINPR_MAINPR1_POSN                      equ 0001h
MAINPR_MAINPR1_POSITION                  equ 0001h
MAINPR_MAINPR1_SIZE                      equ 0001h
MAINPR_MAINPR1_LENGTH                    equ 0001h
MAINPR_MAINPR1_MASK                      equ 0002h
MAINPR_MAINPR2_POSN                      equ 0002h
MAINPR_MAINPR2_POSITION                  equ 0002h
MAINPR_MAINPR2_SIZE                      equ 0001h
MAINPR_MAINPR2_LENGTH                    equ 0001h
MAINPR_MAINPR2_MASK                      equ 0004h

// Register: ISRPR
#define ISRPR ISRPR
ISRPR                                    equ 00BFh
// bitfield definitions
ISRPR_PR_POSN                            equ 0000h
ISRPR_PR_POSITION                        equ 0000h
ISRPR_PR_SIZE                            equ 0003h
ISRPR_PR_LENGTH                          equ 0003h
ISRPR_PR_MASK                            equ 0007h
ISRPR_PR0_POSN                           equ 0000h
ISRPR_PR0_POSITION                       equ 0000h
ISRPR_PR0_SIZE                           equ 0001h
ISRPR_PR0_LENGTH                         equ 0001h
ISRPR_PR0_MASK                           equ 0001h
ISRPR_PR1_POSN                           equ 0001h
ISRPR_PR1_POSITION                       equ 0001h
ISRPR_PR1_SIZE                           equ 0001h
ISRPR_PR1_LENGTH                         equ 0001h
ISRPR_PR1_MASK                           equ 0002h
ISRPR_PR2_POSN                           equ 0002h
ISRPR_PR2_POSITION                       equ 0002h
ISRPR_PR2_SIZE                           equ 0001h
ISRPR_PR2_LENGTH                         equ 0001h
ISRPR_PR2_MASK                           equ 0004h
ISRPR_ISRPR_POSN                         equ 0000h
ISRPR_ISRPR_POSITION                     equ 0000h
ISRPR_ISRPR_SIZE                         equ 0003h
ISRPR_ISRPR_LENGTH                       equ 0003h
ISRPR_ISRPR_MASK                         equ 0007h
ISRPR_ISRPR0_POSN                        equ 0000h
ISRPR_ISRPR0_POSITION                    equ 0000h
ISRPR_ISRPR0_SIZE                        equ 0001h
ISRPR_ISRPR0_LENGTH                      equ 0001h
ISRPR_ISRPR0_MASK                        equ 0001h
ISRPR_ISRPR1_POSN                        equ 0001h
ISRPR_ISRPR1_POSITION                    equ 0001h
ISRPR_ISRPR1_SIZE                        equ 0001h
ISRPR_ISRPR1_LENGTH                      equ 0001h
ISRPR_ISRPR1_MASK                        equ 0002h
ISRPR_ISRPR2_POSN                        equ 0002h
ISRPR_ISRPR2_POSITION                    equ 0002h
ISRPR_ISRPR2_SIZE                        equ 0001h
ISRPR_ISRPR2_LENGTH                      equ 0001h
ISRPR_ISRPR2_MASK                        equ 0004h

// Register: CLCDATA
#define CLCDATA CLCDATA
CLCDATA                                  equ 00D4h
// bitfield definitions
CLCDATA_CLC1OUT_POSN                     equ 0000h
CLCDATA_CLC1OUT_POSITION                 equ 0000h
CLCDATA_CLC1OUT_SIZE                     equ 0001h
CLCDATA_CLC1OUT_LENGTH                   equ 0001h
CLCDATA_CLC1OUT_MASK                     equ 0001h
CLCDATA_CLC2OUT_POSN                     equ 0001h
CLCDATA_CLC2OUT_POSITION                 equ 0001h
CLCDATA_CLC2OUT_SIZE                     equ 0001h
CLCDATA_CLC2OUT_LENGTH                   equ 0001h
CLCDATA_CLC2OUT_MASK                     equ 0002h
CLCDATA_CLC3OUT_POSN                     equ 0002h
CLCDATA_CLC3OUT_POSITION                 equ 0002h
CLCDATA_CLC3OUT_SIZE                     equ 0001h
CLCDATA_CLC3OUT_LENGTH                   equ 0001h
CLCDATA_CLC3OUT_MASK                     equ 0004h
CLCDATA_CLC4OUT_POSN                     equ 0003h
CLCDATA_CLC4OUT_POSITION                 equ 0003h
CLCDATA_CLC4OUT_SIZE                     equ 0001h
CLCDATA_CLC4OUT_LENGTH                   equ 0001h
CLCDATA_CLC4OUT_MASK                     equ 0008h
CLCDATA_CLC5OUT_POSN                     equ 0004h
CLCDATA_CLC5OUT_POSITION                 equ 0004h
CLCDATA_CLC5OUT_SIZE                     equ 0001h
CLCDATA_CLC5OUT_LENGTH                   equ 0001h
CLCDATA_CLC5OUT_MASK                     equ 0010h
CLCDATA_CLC6OUT_POSN                     equ 0005h
CLCDATA_CLC6OUT_POSITION                 equ 0005h
CLCDATA_CLC6OUT_SIZE                     equ 0001h
CLCDATA_CLC6OUT_LENGTH                   equ 0001h
CLCDATA_CLC6OUT_MASK                     equ 0020h
CLCDATA_CLC7OUT_POSN                     equ 0006h
CLCDATA_CLC7OUT_POSITION                 equ 0006h
CLCDATA_CLC7OUT_SIZE                     equ 0001h
CLCDATA_CLC7OUT_LENGTH                   equ 0001h
CLCDATA_CLC7OUT_MASK                     equ 0040h
CLCDATA_CLC8OUT_POSN                     equ 0007h
CLCDATA_CLC8OUT_POSITION                 equ 0007h
CLCDATA_CLC8OUT_SIZE                     equ 0001h
CLCDATA_CLC8OUT_LENGTH                   equ 0001h
CLCDATA_CLC8OUT_MASK                     equ 0080h

// Register: CLCSELECT
#define CLCSELECT CLCSELECT
CLCSELECT                                equ 00D5h
// bitfield definitions
CLCSELECT_SLCT_POSN                      equ 0000h
CLCSELECT_SLCT_POSITION                  equ 0000h
CLCSELECT_SLCT_SIZE                      equ 0008h
CLCSELECT_SLCT_LENGTH                    equ 0008h
CLCSELECT_SLCT_MASK                      equ 00FFh
CLCSELECT_SLCT0_POSN                     equ 0000h
CLCSELECT_SLCT0_POSITION                 equ 0000h
CLCSELECT_SLCT0_SIZE                     equ 0001h
CLCSELECT_SLCT0_LENGTH                   equ 0001h
CLCSELECT_SLCT0_MASK                     equ 0001h
CLCSELECT_SLCT1_POSN                     equ 0001h
CLCSELECT_SLCT1_POSITION                 equ 0001h
CLCSELECT_SLCT1_SIZE                     equ 0001h
CLCSELECT_SLCT1_LENGTH                   equ 0001h
CLCSELECT_SLCT1_MASK                     equ 0002h
CLCSELECT_SLCT2_POSN                     equ 0002h
CLCSELECT_SLCT2_POSITION                 equ 0002h
CLCSELECT_SLCT2_SIZE                     equ 0001h
CLCSELECT_SLCT2_LENGTH                   equ 0001h
CLCSELECT_SLCT2_MASK                     equ 0004h

