GopalSaraf/Practicals/PSDL/include/proc/pic18f47q43.inc
// Register: U1FIFO
#define U1FIFO U1FIFO
U1FIFO                                   equ 02B0h
// bitfield definitions
U1FIFO_RXBF_POSN                         equ 0000h
U1FIFO_RXBF_POSITION                     equ 0000h
U1FIFO_RXBF_SIZE                         equ 0001h
U1FIFO_RXBF_LENGTH                       equ 0001h
U1FIFO_RXBF_MASK                         equ 0001h
U1FIFO_RXBE_POSN                         equ 0001h
U1FIFO_RXBE_POSITION                     equ 0001h
U1FIFO_RXBE_SIZE                         equ 0001h
U1FIFO_RXBE_LENGTH                       equ 0001h
U1FIFO_RXBE_MASK                         equ 0002h
U1FIFO_XON_POSN                          equ 0002h
U1FIFO_XON_POSITION                      equ 0002h
U1FIFO_XON_SIZE                          equ 0001h
U1FIFO_XON_LENGTH                        equ 0001h
U1FIFO_XON_MASK                          equ 0004h
U1FIFO_RXIDL_POSN                        equ 0003h
U1FIFO_RXIDL_POSITION                    equ 0003h
U1FIFO_RXIDL_SIZE                        equ 0001h
U1FIFO_RXIDL_LENGTH                      equ 0001h
U1FIFO_RXIDL_MASK                        equ 0008h
U1FIFO_TXBF_POSN                         equ 0004h
U1FIFO_TXBF_POSITION                     equ 0004h
U1FIFO_TXBF_SIZE                         equ 0001h
U1FIFO_TXBF_LENGTH                       equ 0001h
U1FIFO_TXBF_MASK                         equ 0010h
U1FIFO_TXBE_POSN                         equ 0005h
U1FIFO_TXBE_POSITION                     equ 0005h
U1FIFO_TXBE_SIZE                         equ 0001h
U1FIFO_TXBE_LENGTH                       equ 0001h
U1FIFO_TXBE_MASK                         equ 0020h
U1FIFO_STPMD_POSN                        equ 0006h
U1FIFO_STPMD_POSITION                    equ 0006h
U1FIFO_STPMD_SIZE                        equ 0001h
U1FIFO_STPMD_LENGTH                      equ 0001h
U1FIFO_STPMD_MASK                        equ 0040h
U1FIFO_TXWRE_POSN                        equ 0007h
U1FIFO_TXWRE_POSITION                    equ 0007h
U1FIFO_TXWRE_SIZE                        equ 0001h
U1FIFO_TXWRE_LENGTH                      equ 0001h
U1FIFO_TXWRE_MASK                        equ 0080h
U1FIFO_U1RXBF_POSN                       equ 0000h
U1FIFO_U1RXBF_POSITION                   equ 0000h
U1FIFO_U1RXBF_SIZE                       equ 0001h
U1FIFO_U1RXBF_LENGTH                     equ 0001h
U1FIFO_U1RXBF_MASK                       equ 0001h
U1FIFO_U1RXBE_POSN                       equ 0001h
U1FIFO_U1RXBE_POSITION                   equ 0001h
U1FIFO_U1RXBE_SIZE                       equ 0001h
U1FIFO_U1RXBE_LENGTH                     equ 0001h
U1FIFO_U1RXBE_MASK                       equ 0002h
U1FIFO_U1XON_POSN                        equ 0002h
U1FIFO_U1XON_POSITION                    equ 0002h
U1FIFO_U1XON_SIZE                        equ 0001h
U1FIFO_U1XON_LENGTH                      equ 0001h
U1FIFO_U1XON_MASK                        equ 0004h
U1FIFO_U1RXIDL_POSN                      equ 0003h
U1FIFO_U1RXIDL_POSITION                  equ 0003h
U1FIFO_U1RXIDL_SIZE                      equ 0001h
U1FIFO_U1RXIDL_LENGTH                    equ 0001h
U1FIFO_U1RXIDL_MASK                      equ 0008h
U1FIFO_U1TXBF_POSN                       equ 0004h
U1FIFO_U1TXBF_POSITION                   equ 0004h
U1FIFO_U1TXBF_SIZE                       equ 0001h
U1FIFO_U1TXBF_LENGTH                     equ 0001h
U1FIFO_U1TXBF_MASK                       equ 0010h
U1FIFO_U1TXBE_POSN                       equ 0005h
U1FIFO_U1TXBE_POSITION                   equ 0005h
U1FIFO_U1TXBE_SIZE                       equ 0001h
U1FIFO_U1TXBE_LENGTH                     equ 0001h
U1FIFO_U1TXBE_MASK                       equ 0020h
U1FIFO_U1STPMD_POSN                      equ 0006h
U1FIFO_U1STPMD_POSITION                  equ 0006h
U1FIFO_U1STPMD_SIZE                      equ 0001h
U1FIFO_U1STPMD_LENGTH                    equ 0001h
U1FIFO_U1STPMD_MASK                      equ 0040h
U1FIFO_U1TXWRE_POSN                      equ 0007h
U1FIFO_U1TXWRE_POSITION                  equ 0007h
U1FIFO_U1TXWRE_SIZE                      equ 0001h
U1FIFO_U1TXWRE_LENGTH                    equ 0001h
U1FIFO_U1TXWRE_MASK                      equ 0080h
U1FIFO_U1RCIDL_POSN                      equ 0003h
U1FIFO_U1RCIDL_POSITION                  equ 0003h
U1FIFO_U1RCIDL_SIZE                      equ 0001h
U1FIFO_U1RCIDL_LENGTH                    equ 0001h
U1FIFO_U1RCIDL_MASK                      equ 0008h
U1FIFO_RCIDL_POSN                        equ 0003h
U1FIFO_RCIDL_POSITION                    equ 0003h
U1FIFO_RCIDL_SIZE                        equ 0001h
U1FIFO_RCIDL_LENGTH                      equ 0001h
U1FIFO_RCIDL_MASK                        equ 0008h

// Register: U1UIR
#define U1UIR U1UIR
U1UIR                                    equ 02B1h
// bitfield definitions
U1UIR_ABDIE_POSN                         equ 0002h
U1UIR_ABDIE_POSITION                     equ 0002h
U1UIR_ABDIE_SIZE                         equ 0001h
U1UIR_ABDIE_LENGTH                       equ 0001h
U1UIR_ABDIE_MASK                         equ 0004h
U1UIR_ABDIF_POSN                         equ 0006h
U1UIR_ABDIF_POSITION                     equ 0006h
U1UIR_ABDIF_SIZE                         equ 0001h
U1UIR_ABDIF_LENGTH                       equ 0001h
U1UIR_ABDIF_MASK                         equ 0040h
U1UIR_WUIF_POSN                          equ 0007h
U1UIR_WUIF_POSITION                      equ 0007h
U1UIR_WUIF_SIZE                          equ 0001h
U1UIR_WUIF_LENGTH                        equ 0001h
U1UIR_WUIF_MASK                          equ 0080h
U1UIR_U1ABDIE_POSN                       equ 0002h
U1UIR_U1ABDIE_POSITION                   equ 0002h
U1UIR_U1ABDIE_SIZE                       equ 0001h
U1UIR_U1ABDIE_LENGTH                     equ 0001h
U1UIR_U1ABDIE_MASK                       equ 0004h
U1UIR_U1ABDIF_POSN                       equ 0006h
U1UIR_U1ABDIF_POSITION                   equ 0006h
U1UIR_U1ABDIF_SIZE                       equ 0001h
U1UIR_U1ABDIF_LENGTH                     equ 0001h
U1UIR_U1ABDIF_MASK                       equ 0040h
U1UIR_U1WUIF_POSN                        equ 0007h
U1UIR_U1WUIF_POSITION                    equ 0007h
U1UIR_U1WUIF_SIZE                        equ 0001h
U1UIR_U1WUIF_LENGTH                      equ 0001h
U1UIR_U1WUIF_MASK                        equ 0080h

