GopalSaraf/Practicals/PSDL/include/proc/pic18f47q43.inc
// Register: T0CON0
#define T0CON0 T0CON0
T0CON0                                   equ 031Ah
// bitfield definitions
T0CON0_OUTPS_POSN                        equ 0000h
T0CON0_OUTPS_POSITION                    equ 0000h
T0CON0_OUTPS_SIZE                        equ 0004h
T0CON0_OUTPS_LENGTH                      equ 0004h
T0CON0_OUTPS_MASK                        equ 000Fh
T0CON0_MD16_POSN                         equ 0004h
T0CON0_MD16_POSITION                     equ 0004h
T0CON0_MD16_SIZE                         equ 0001h
T0CON0_MD16_LENGTH                       equ 0001h
T0CON0_MD16_MASK                         equ 0010h
T0CON0_OUT_POSN                          equ 0005h
T0CON0_OUT_POSITION                      equ 0005h
T0CON0_OUT_SIZE                          equ 0001h
T0CON0_OUT_LENGTH                        equ 0001h
T0CON0_OUT_MASK                          equ 0020h
T0CON0_EN_POSN                           equ 0007h
T0CON0_EN_POSITION                       equ 0007h
T0CON0_EN_SIZE                           equ 0001h
T0CON0_EN_LENGTH                         equ 0001h
T0CON0_EN_MASK                           equ 0080h
T0CON0_T0OUTPS_POSN                      equ 0000h
T0CON0_T0OUTPS_POSITION                  equ 0000h
T0CON0_T0OUTPS_SIZE                      equ 0004h
T0CON0_T0OUTPS_LENGTH                    equ 0004h
T0CON0_T0OUTPS_MASK                      equ 000Fh
T0CON0_T0MD16_POSN                       equ 0004h
T0CON0_T0MD16_POSITION                   equ 0004h
T0CON0_T0MD16_SIZE                       equ 0001h
T0CON0_T0MD16_LENGTH                     equ 0001h
T0CON0_T0MD16_MASK                       equ 0010h
T0CON0_T0OUT_POSN                        equ 0005h
T0CON0_T0OUT_POSITION                    equ 0005h
T0CON0_T0OUT_SIZE                        equ 0001h
T0CON0_T0OUT_LENGTH                      equ 0001h
T0CON0_T0OUT_MASK                        equ 0020h
T0CON0_T0EN_POSN                         equ 0007h
T0CON0_T0EN_POSITION                     equ 0007h
T0CON0_T0EN_SIZE                         equ 0001h
T0CON0_T0EN_LENGTH                       equ 0001h
T0CON0_T0EN_MASK                         equ 0080h
T0CON0_OUTPS0_POSN                       equ 0000h
T0CON0_OUTPS0_POSITION                   equ 0000h
T0CON0_OUTPS0_SIZE                       equ 0001h
T0CON0_OUTPS0_LENGTH                     equ 0001h
T0CON0_OUTPS0_MASK                       equ 0001h
T0CON0_OUTPS1_POSN                       equ 0001h
T0CON0_OUTPS1_POSITION                   equ 0001h
T0CON0_OUTPS1_SIZE                       equ 0001h
T0CON0_OUTPS1_LENGTH                     equ 0001h
T0CON0_OUTPS1_MASK                       equ 0002h
T0CON0_OUTPS2_POSN                       equ 0002h
T0CON0_OUTPS2_POSITION                   equ 0002h
T0CON0_OUTPS2_SIZE                       equ 0001h
T0CON0_OUTPS2_LENGTH                     equ 0001h
T0CON0_OUTPS2_MASK                       equ 0004h
T0CON0_OUTPS3_POSN                       equ 0003h
T0CON0_OUTPS3_POSITION                   equ 0003h
T0CON0_OUTPS3_SIZE                       equ 0001h
T0CON0_OUTPS3_LENGTH                     equ 0001h
T0CON0_OUTPS3_MASK                       equ 0008h
T0CON0_T016BIT_POSN                      equ 0004h
T0CON0_T016BIT_POSITION                  equ 0004h
T0CON0_T016BIT_SIZE                      equ 0001h
T0CON0_T016BIT_LENGTH                    equ 0001h
T0CON0_T016BIT_MASK                      equ 0010h

// Register: T0CON1
#define T0CON1 T0CON1
T0CON1                                   equ 031Bh
// bitfield definitions
T0CON1_CKPS_POSN                         equ 0000h
T0CON1_CKPS_POSITION                     equ 0000h
T0CON1_CKPS_SIZE                         equ 0004h
T0CON1_CKPS_LENGTH                       equ 0004h
T0CON1_CKPS_MASK                         equ 000Fh
T0CON1_ASYNC_POSN                        equ 0004h
T0CON1_ASYNC_POSITION                    equ 0004h
T0CON1_ASYNC_SIZE                        equ 0001h
T0CON1_ASYNC_LENGTH                      equ 0001h
T0CON1_ASYNC_MASK                        equ 0010h
T0CON1_CS_POSN                           equ 0005h
T0CON1_CS_POSITION                       equ 0005h
T0CON1_CS_SIZE                           equ 0003h
T0CON1_CS_LENGTH                         equ 0003h
T0CON1_CS_MASK                           equ 00E0h
T0CON1_CKPS0_POSN                        equ 0000h
T0CON1_CKPS0_POSITION                    equ 0000h
T0CON1_CKPS0_SIZE                        equ 0001h
T0CON1_CKPS0_LENGTH                      equ 0001h
T0CON1_CKPS0_MASK                        equ 0001h
T0CON1_CKPS1_POSN                        equ 0001h
T0CON1_CKPS1_POSITION                    equ 0001h
T0CON1_CKPS1_SIZE                        equ 0001h
T0CON1_CKPS1_LENGTH                      equ 0001h
T0CON1_CKPS1_MASK                        equ 0002h
T0CON1_CKPS2_POSN                        equ 0002h
T0CON1_CKPS2_POSITION                    equ 0002h
T0CON1_CKPS2_SIZE                        equ 0001h
T0CON1_CKPS2_LENGTH                      equ 0001h
T0CON1_CKPS2_MASK                        equ 0004h
T0CON1_CKPS3_POSN                        equ 0003h
T0CON1_CKPS3_POSITION                    equ 0003h
T0CON1_CKPS3_SIZE                        equ 0001h
T0CON1_CKPS3_LENGTH                      equ 0001h
T0CON1_CKPS3_MASK                        equ 0008h
T0CON1_T0ASYNC_POSN                      equ 0004h
T0CON1_T0ASYNC_POSITION                  equ 0004h
T0CON1_T0ASYNC_SIZE                      equ 0001h
T0CON1_T0ASYNC_LENGTH                    equ 0001h
T0CON1_T0ASYNC_MASK                      equ 0010h
T0CON1_CS0_POSN                          equ 0005h
T0CON1_CS0_POSITION                      equ 0005h
T0CON1_CS0_SIZE                          equ 0001h
T0CON1_CS0_LENGTH                        equ 0001h
T0CON1_CS0_MASK                          equ 0020h
T0CON1_CS1_POSN                          equ 0006h
T0CON1_CS1_POSITION                      equ 0006h
T0CON1_CS1_SIZE                          equ 0001h
T0CON1_CS1_LENGTH                        equ 0001h
T0CON1_CS1_MASK                          equ 0040h
T0CON1_CS2_POSN                          equ 0007h
T0CON1_CS2_POSITION                      equ 0007h
T0CON1_CS2_SIZE                          equ 0001h
T0CON1_CS2_LENGTH                        equ 0001h
T0CON1_CS2_MASK                          equ 0080h
T0CON1_T0CKPS_POSN                       equ 0000h
T0CON1_T0CKPS_POSITION                   equ 0000h
T0CON1_T0CKPS_SIZE                       equ 0004h
T0CON1_T0CKPS_LENGTH                     equ 0004h
T0CON1_T0CKPS_MASK                       equ 000Fh
T0CON1_T0CS_POSN                         equ 0005h
T0CON1_T0CS_POSITION                     equ 0005h
T0CON1_T0CS_SIZE                         equ 0003h
T0CON1_T0CS_LENGTH                       equ 0003h
T0CON1_T0CS_MASK                         equ 00E0h
T0CON1_T0CKPS0_POSN                      equ 0000h
T0CON1_T0CKPS0_POSITION                  equ 0000h
T0CON1_T0CKPS0_SIZE                      equ 0001h
T0CON1_T0CKPS0_LENGTH                    equ 0001h
T0CON1_T0CKPS0_MASK                      equ 0001h
T0CON1_T0CKPS1_POSN                      equ 0001h
T0CON1_T0CKPS1_POSITION                  equ 0001h
T0CON1_T0CKPS1_SIZE                      equ 0001h
T0CON1_T0CKPS1_LENGTH                    equ 0001h
T0CON1_T0CKPS1_MASK                      equ 0002h
T0CON1_T0CKPS2_POSN                      equ 0002h
T0CON1_T0CKPS2_POSITION                  equ 0002h
T0CON1_T0CKPS2_SIZE                      equ 0001h
T0CON1_T0CKPS2_LENGTH                    equ 0001h
T0CON1_T0CKPS2_MASK                      equ 0004h
T0CON1_T0CKPS3_POSN                      equ 0003h
T0CON1_T0CKPS3_POSITION                  equ 0003h
T0CON1_T0CKPS3_SIZE                      equ 0001h
T0CON1_T0CKPS3_LENGTH                    equ 0001h
T0CON1_T0CKPS3_MASK                      equ 0008h
T0CON1_T0CS0_POSN                        equ 0005h
T0CON1_T0CS0_POSITION                    equ 0005h
T0CON1_T0CS0_SIZE                        equ 0001h
T0CON1_T0CS0_LENGTH                      equ 0001h
T0CON1_T0CS0_MASK                        equ 0020h
T0CON1_T0CS1_POSN                        equ 0006h
T0CON1_T0CS1_POSITION                    equ 0006h
T0CON1_T0CS1_SIZE                        equ 0001h
T0CON1_T0CS1_LENGTH                      equ 0001h
T0CON1_T0CS1_MASK                        equ 0040h
T0CON1_T0CS2_POSN                        equ 0007h
T0CON1_T0CS2_POSITION                    equ 0007h
T0CON1_T0CS2_SIZE                        equ 0001h
T0CON1_T0CS2_LENGTH                      equ 0001h
T0CON1_T0CS2_MASK                        equ 0080h

// Register: TMR1L
#define TMR1L TMR1L
TMR1L                                    equ 031Ch
// bitfield definitions
TMR1L_TMR1L_POSN                         equ 0000h
TMR1L_TMR1L_POSITION                     equ 0000h
TMR1L_TMR1L_SIZE                         equ 0008h
TMR1L_TMR1L_LENGTH                       equ 0008h
TMR1L_TMR1L_MASK                         equ 00FFh
TMR1L_TMR1L0_POSN                        equ 0000h
TMR1L_TMR1L0_POSITION                    equ 0000h
TMR1L_TMR1L0_SIZE                        equ 0001h
TMR1L_TMR1L0_LENGTH                      equ 0001h
TMR1L_TMR1L0_MASK                        equ 0001h
TMR1L_TMR1L1_POSN                        equ 0001h
TMR1L_TMR1L1_POSITION                    equ 0001h
TMR1L_TMR1L1_SIZE                        equ 0001h
TMR1L_TMR1L1_LENGTH                      equ 0001h
TMR1L_TMR1L1_MASK                        equ 0002h
TMR1L_TMR1L2_POSN                        equ 0002h
TMR1L_TMR1L2_POSITION                    equ 0002h
TMR1L_TMR1L2_SIZE                        equ 0001h
TMR1L_TMR1L2_LENGTH                      equ 0001h
TMR1L_TMR1L2_MASK                        equ 0004h
TMR1L_TMR1L3_POSN                        equ 0003h
TMR1L_TMR1L3_POSITION                    equ 0003h
TMR1L_TMR1L3_SIZE                        equ 0001h
TMR1L_TMR1L3_LENGTH                      equ 0001h
TMR1L_TMR1L3_MASK                        equ 0008h
TMR1L_TMR1L4_POSN                        equ 0004h
TMR1L_TMR1L4_POSITION                    equ 0004h
TMR1L_TMR1L4_SIZE                        equ 0001h
TMR1L_TMR1L4_LENGTH                      equ 0001h
TMR1L_TMR1L4_MASK                        equ 0010h
TMR1L_TMR1L5_POSN                        equ 0005h
TMR1L_TMR1L5_POSITION                    equ 0005h
TMR1L_TMR1L5_SIZE                        equ 0001h
TMR1L_TMR1L5_LENGTH                      equ 0001h
TMR1L_TMR1L5_MASK                        equ 0020h
TMR1L_TMR1L6_POSN                        equ 0006h
TMR1L_TMR1L6_POSITION                    equ 0006h
TMR1L_TMR1L6_SIZE                        equ 0001h
TMR1L_TMR1L6_LENGTH                      equ 0001h
TMR1L_TMR1L6_MASK                        equ 0040h
TMR1L_TMR1L7_POSN                        equ 0007h
TMR1L_TMR1L7_POSITION                    equ 0007h
TMR1L_TMR1L7_SIZE                        equ 0001h
TMR1L_TMR1L7_LENGTH                      equ 0001h
TMR1L_TMR1L7_MASK                        equ 0080h

// Register: TMR1H
#define TMR1H TMR1H
TMR1H                                    equ 031Dh
// bitfield definitions
TMR1H_TMR1H_POSN                         equ 0000h
TMR1H_TMR1H_POSITION                     equ 0000h
TMR1H_TMR1H_SIZE                         equ 0008h
TMR1H_TMR1H_LENGTH                       equ 0008h
TMR1H_TMR1H_MASK                         equ 00FFh
TMR1H_TMR1H0_POSN                        equ 0000h
TMR1H_TMR1H0_POSITION                    equ 0000h
TMR1H_TMR1H0_SIZE                        equ 0001h
TMR1H_TMR1H0_LENGTH                      equ 0001h
TMR1H_TMR1H0_MASK                        equ 0001h
TMR1H_TMR1H1_POSN                        equ 0001h
TMR1H_TMR1H1_POSITION                    equ 0001h
TMR1H_TMR1H1_SIZE                        equ 0001h
TMR1H_TMR1H1_LENGTH                      equ 0001h
TMR1H_TMR1H1_MASK                        equ 0002h
TMR1H_TMR1H2_POSN                        equ 0002h
TMR1H_TMR1H2_POSITION                    equ 0002h
TMR1H_TMR1H2_SIZE                        equ 0001h
TMR1H_TMR1H2_LENGTH                      equ 0001h
TMR1H_TMR1H2_MASK                        equ 0004h
TMR1H_TMR1H3_POSN                        equ 0003h
TMR1H_TMR1H3_POSITION                    equ 0003h
TMR1H_TMR1H3_SIZE                        equ 0001h
TMR1H_TMR1H3_LENGTH                      equ 0001h
TMR1H_TMR1H3_MASK                        equ 0008h
TMR1H_TMR1H4_POSN                        equ 0004h
TMR1H_TMR1H4_POSITION                    equ 0004h
TMR1H_TMR1H4_SIZE                        equ 0001h
TMR1H_TMR1H4_LENGTH                      equ 0001h
TMR1H_TMR1H4_MASK                        equ 0010h
TMR1H_TMR1H5_POSN                        equ 0005h
TMR1H_TMR1H5_POSITION                    equ 0005h
TMR1H_TMR1H5_SIZE                        equ 0001h
TMR1H_TMR1H5_LENGTH                      equ 0001h
TMR1H_TMR1H5_MASK                        equ 0020h
TMR1H_TMR1H6_POSN                        equ 0006h
TMR1H_TMR1H6_POSITION                    equ 0006h
TMR1H_TMR1H6_SIZE                        equ 0001h
TMR1H_TMR1H6_LENGTH                      equ 0001h
TMR1H_TMR1H6_MASK                        equ 0040h
TMR1H_TMR1H7_POSN                        equ 0007h
TMR1H_TMR1H7_POSITION                    equ 0007h
TMR1H_TMR1H7_SIZE                        equ 0001h
TMR1H_TMR1H7_LENGTH                      equ 0001h
TMR1H_TMR1H7_MASK                        equ 0080h

