GopalSaraf/Practicals/PSDL/include/proc/pic18f47q43.inc
// Register: IPR14
#define IPR14 IPR14
IPR14                                    equ 0370h
// bitfield definitions
IPR14_CLC7IP_POSN                        equ 0001h
IPR14_CLC7IP_POSITION                    equ 0001h
IPR14_CLC7IP_SIZE                        equ 0001h
IPR14_CLC7IP_LENGTH                      equ 0001h
IPR14_CLC7IP_MASK                        equ 0002h
IPR14_C2IP_POSN                          equ 0002h
IPR14_C2IP_POSITION                      equ 0002h
IPR14_C2IP_SIZE                          equ 0001h
IPR14_C2IP_LENGTH                        equ 0001h
IPR14_C2IP_MASK                          equ 0004h
IPR14_NCO3IP_POSN                        equ 0003h
IPR14_NCO3IP_POSITION                    equ 0003h
IPR14_NCO3IP_SIZE                        equ 0001h
IPR14_NCO3IP_LENGTH                      equ 0001h
IPR14_NCO3IP_MASK                        equ 0008h

// Register: IPR15
#define IPR15 IPR15
IPR15                                    equ 0371h
// bitfield definitions
IPR15_NVMIP_POSN                         equ 0000h
IPR15_NVMIP_POSITION                     equ 0000h
IPR15_NVMIP_SIZE                         equ 0001h
IPR15_NVMIP_LENGTH                       equ 0001h
IPR15_NVMIP_MASK                         equ 0001h
IPR15_CLC8IP_POSN                        equ 0001h
IPR15_CLC8IP_POSITION                    equ 0001h
IPR15_CLC8IP_SIZE                        equ 0001h
IPR15_CLC8IP_LENGTH                      equ 0001h
IPR15_CLC8IP_MASK                        equ 0002h
IPR15_CRCIP_POSN                         equ 0002h
IPR15_CRCIP_POSITION                     equ 0002h
IPR15_CRCIP_SIZE                         equ 0001h
IPR15_CRCIP_LENGTH                       equ 0001h
IPR15_CRCIP_MASK                         equ 0004h
IPR15_TMR6IP_POSN                        equ 0003h
IPR15_TMR6IP_POSITION                    equ 0003h
IPR15_TMR6IP_SIZE                        equ 0001h
IPR15_TMR6IP_LENGTH                      equ 0001h
IPR15_TMR6IP_MASK                        equ 0008h

// Register: STATUS_CSHAD
#define STATUS_CSHAD STATUS_CSHAD
STATUS_CSHAD                             equ 0373h
// bitfield definitions
STATUS_CSHAD_NOT_PD_POSN                 equ 0005h
STATUS_CSHAD_NOT_PD_POSITION             equ 0005h
STATUS_CSHAD_NOT_PD_SIZE                 equ 0001h
STATUS_CSHAD_NOT_PD_LENGTH               equ 0001h
STATUS_CSHAD_NOT_PD_MASK                 equ 0020h
STATUS_CSHAD_NOT_TO_POSN                 equ 0006h
STATUS_CSHAD_NOT_TO_POSITION             equ 0006h
STATUS_CSHAD_NOT_TO_SIZE                 equ 0001h
STATUS_CSHAD_NOT_TO_LENGTH               equ 0001h
STATUS_CSHAD_NOT_TO_MASK                 equ 0040h
STATUS_CSHAD_C_POSN                      equ 0000h
STATUS_CSHAD_C_POSITION                  equ 0000h
STATUS_CSHAD_C_SIZE                      equ 0001h
STATUS_CSHAD_C_LENGTH                    equ 0001h
STATUS_CSHAD_C_MASK                      equ 0001h
STATUS_CSHAD_DC_POSN                     equ 0001h
STATUS_CSHAD_DC_POSITION                 equ 0001h
STATUS_CSHAD_DC_SIZE                     equ 0001h
STATUS_CSHAD_DC_LENGTH                   equ 0001h
STATUS_CSHAD_DC_MASK                     equ 0002h
STATUS_CSHAD_Z_POSN                      equ 0002h
STATUS_CSHAD_Z_POSITION                  equ 0002h
STATUS_CSHAD_Z_SIZE                      equ 0001h
STATUS_CSHAD_Z_LENGTH                    equ 0001h
STATUS_CSHAD_Z_MASK                      equ 0004h
STATUS_CSHAD_OV_POSN                     equ 0003h
STATUS_CSHAD_OV_POSITION                 equ 0003h
STATUS_CSHAD_OV_SIZE                     equ 0001h
STATUS_CSHAD_OV_LENGTH                   equ 0001h
STATUS_CSHAD_OV_MASK                     equ 0008h
STATUS_CSHAD_N_POSN                      equ 0004h
STATUS_CSHAD_N_POSITION                  equ 0004h
STATUS_CSHAD_N_SIZE                      equ 0001h
STATUS_CSHAD_N_LENGTH                    equ 0001h
STATUS_CSHAD_N_MASK                      equ 0010h
STATUS_CSHAD_nPD_POSN                    equ 0005h
STATUS_CSHAD_nPD_POSITION                equ 0005h
STATUS_CSHAD_nPD_SIZE                    equ 0001h
STATUS_CSHAD_nPD_LENGTH                  equ 0001h
STATUS_CSHAD_nPD_MASK                    equ 0020h
STATUS_CSHAD_nTO_POSN                    equ 0006h
STATUS_CSHAD_nTO_POSITION                equ 0006h
STATUS_CSHAD_nTO_SIZE                    equ 0001h
STATUS_CSHAD_nTO_LENGTH                  equ 0001h
STATUS_CSHAD_nTO_MASK                    equ 0040h
STATUS_CSHAD_PD_POSN                     equ 0005h
STATUS_CSHAD_PD_POSITION                 equ 0005h
STATUS_CSHAD_PD_SIZE                     equ 0001h
STATUS_CSHAD_PD_LENGTH                   equ 0001h
STATUS_CSHAD_PD_MASK                     equ 0020h
STATUS_CSHAD_TO_POSN                     equ 0006h
STATUS_CSHAD_TO_POSITION                 equ 0006h
STATUS_CSHAD_TO_SIZE                     equ 0001h
STATUS_CSHAD_TO_LENGTH                   equ 0001h
STATUS_CSHAD_TO_MASK                     equ 0040h

// Register: WREG_CSHAD
#define WREG_CSHAD WREG_CSHAD
WREG_CSHAD                               equ 0374h
// bitfield definitions
WREG_CSHAD_WREG_POSN                     equ 0000h
WREG_CSHAD_WREG_POSITION                 equ 0000h
WREG_CSHAD_WREG_SIZE                     equ 0008h
WREG_CSHAD_WREG_LENGTH                   equ 0008h
WREG_CSHAD_WREG_MASK                     equ 00FFh

// Register: BSR_CSHAD
#define BSR_CSHAD BSR_CSHAD
BSR_CSHAD                                equ 0375h

// Register: SHADCON
#define SHADCON SHADCON
SHADCON                                  equ 0376h
// bitfield definitions
SHADCON_SHADLO_POSN                      equ 0000h
SHADCON_SHADLO_POSITION                  equ 0000h
SHADCON_SHADLO_SIZE                      equ 0001h
SHADCON_SHADLO_LENGTH                    equ 0001h
SHADCON_SHADLO_MASK                      equ 0001h

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 0377h
// bitfield definitions
STATUS_SHAD_NOT_PD_POSN                  equ 0005h
STATUS_SHAD_NOT_PD_POSITION              equ 0005h
STATUS_SHAD_NOT_PD_SIZE                  equ 0001h
STATUS_SHAD_NOT_PD_LENGTH                equ 0001h
STATUS_SHAD_NOT_PD_MASK                  equ 0020h
STATUS_SHAD_NOT_TO_POSN                  equ 0006h
STATUS_SHAD_NOT_TO_POSITION              equ 0006h
STATUS_SHAD_NOT_TO_SIZE                  equ 0001h
STATUS_SHAD_NOT_TO_LENGTH                equ 0001h
STATUS_SHAD_NOT_TO_MASK                  equ 0040h
STATUS_SHAD_C_POSN                       equ 0000h
STATUS_SHAD_C_POSITION                   equ 0000h
STATUS_SHAD_C_SIZE                       equ 0001h
STATUS_SHAD_C_LENGTH                     equ 0001h
STATUS_SHAD_C_MASK                       equ 0001h
STATUS_SHAD_DC_POSN                      equ 0001h
STATUS_SHAD_DC_POSITION                  equ 0001h
STATUS_SHAD_DC_SIZE                      equ 0001h
STATUS_SHAD_DC_LENGTH                    equ 0001h
STATUS_SHAD_DC_MASK                      equ 0002h
STATUS_SHAD_Z_POSN                       equ 0002h
STATUS_SHAD_Z_POSITION                   equ 0002h
STATUS_SHAD_Z_SIZE                       equ 0001h
STATUS_SHAD_Z_LENGTH                     equ 0001h
STATUS_SHAD_Z_MASK                       equ 0004h
STATUS_SHAD_OV_POSN                      equ 0003h
STATUS_SHAD_OV_POSITION                  equ 0003h
STATUS_SHAD_OV_SIZE                      equ 0001h
STATUS_SHAD_OV_LENGTH                    equ 0001h
STATUS_SHAD_OV_MASK                      equ 0008h
STATUS_SHAD_N_POSN                       equ 0004h
STATUS_SHAD_N_POSITION                   equ 0004h
STATUS_SHAD_N_SIZE                       equ 0001h
STATUS_SHAD_N_LENGTH                     equ 0001h
STATUS_SHAD_N_MASK                       equ 0010h
STATUS_SHAD_nPD_POSN                     equ 0005h
STATUS_SHAD_nPD_POSITION                 equ 0005h
STATUS_SHAD_nPD_SIZE                     equ 0001h
STATUS_SHAD_nPD_LENGTH                   equ 0001h
STATUS_SHAD_nPD_MASK                     equ 0020h
STATUS_SHAD_nTO_POSN                     equ 0006h
STATUS_SHAD_nTO_POSITION                 equ 0006h
STATUS_SHAD_nTO_SIZE                     equ 0001h
STATUS_SHAD_nTO_LENGTH                   equ 0001h
STATUS_SHAD_nTO_MASK                     equ 0040h
STATUS_SHAD_PD_POSN                      equ 0005h
STATUS_SHAD_PD_POSITION                  equ 0005h
STATUS_SHAD_PD_SIZE                      equ 0001h
STATUS_SHAD_PD_LENGTH                    equ 0001h
STATUS_SHAD_PD_MASK                      equ 0020h
STATUS_SHAD_TO_POSN                      equ 0006h
STATUS_SHAD_TO_POSITION                  equ 0006h
STATUS_SHAD_TO_SIZE                      equ 0001h
STATUS_SHAD_TO_LENGTH                    equ 0001h
STATUS_SHAD_TO_MASK                      equ 0040h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 0378h
// bitfield definitions
WREG_SHAD_WREG_POSN                      equ 0000h
WREG_SHAD_WREG_POSITION                  equ 0000h
WREG_SHAD_WREG_SIZE                      equ 0008h
WREG_SHAD_WREG_LENGTH                    equ 0008h
WREG_SHAD_WREG_MASK                      equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 0379h

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 037Ah
// bitfield definitions
PCLATH_SHAD_PCH_POSN                     equ 0000h
PCLATH_SHAD_PCH_POSITION                 equ 0000h
PCLATH_SHAD_PCH_SIZE                     equ 0008h
PCLATH_SHAD_PCH_LENGTH                   equ 0008h
PCLATH_SHAD_PCH_MASK                     equ 00FFh

