GopalSaraf/Practicals/PSDL/include/proc/pic18f47q43.inc
// Register: PWM2CON
#define PWM2CON PWM2CON
PWM2CON                                  equ 0478h
// bitfield definitions
PWM2CON_ERSNOW_POSN                      equ 0000h
PWM2CON_ERSNOW_POSITION                  equ 0000h
PWM2CON_ERSNOW_SIZE                      equ 0001h
PWM2CON_ERSNOW_LENGTH                    equ 0001h
PWM2CON_ERSNOW_MASK                      equ 0001h
PWM2CON_ERSPOL_POSN                      equ 0001h
PWM2CON_ERSPOL_POSITION                  equ 0001h
PWM2CON_ERSPOL_SIZE                      equ 0001h
PWM2CON_ERSPOL_LENGTH                    equ 0001h
PWM2CON_ERSPOL_MASK                      equ 0002h
PWM2CON_LD_POSN                          equ 0002h
PWM2CON_LD_POSITION                      equ 0002h
PWM2CON_LD_SIZE                          equ 0001h
PWM2CON_LD_LENGTH                        equ 0001h
PWM2CON_LD_MASK                          equ 0004h
PWM2CON_EN_POSN                          equ 0007h
PWM2CON_EN_POSITION                      equ 0007h
PWM2CON_EN_SIZE                          equ 0001h
PWM2CON_EN_LENGTH                        equ 0001h
PWM2CON_EN_MASK                          equ 0080h

// Register: PWM2S1CFG
#define PWM2S1CFG PWM2S1CFG
PWM2S1CFG                                equ 0479h
// bitfield definitions
PWM2S1CFG_MODE_POSN                      equ 0000h
PWM2S1CFG_MODE_POSITION                  equ 0000h
PWM2S1CFG_MODE_SIZE                      equ 0003h
PWM2S1CFG_MODE_LENGTH                    equ 0003h
PWM2S1CFG_MODE_MASK                      equ 0007h
PWM2S1CFG_PPEN_POSN                      equ 0003h
PWM2S1CFG_PPEN_POSITION                  equ 0003h
PWM2S1CFG_PPEN_SIZE                      equ 0001h
PWM2S1CFG_PPEN_LENGTH                    equ 0001h
PWM2S1CFG_PPEN_MASK                      equ 0008h
PWM2S1CFG_POL1_POSN                      equ 0006h
PWM2S1CFG_POL1_POSITION                  equ 0006h
PWM2S1CFG_POL1_SIZE                      equ 0001h
PWM2S1CFG_POL1_LENGTH                    equ 0001h
PWM2S1CFG_POL1_MASK                      equ 0040h
PWM2S1CFG_POL2_POSN                      equ 0007h
PWM2S1CFG_POL2_POSITION                  equ 0007h
PWM2S1CFG_POL2_SIZE                      equ 0001h
PWM2S1CFG_POL2_LENGTH                    equ 0001h
PWM2S1CFG_POL2_MASK                      equ 0080h
PWM2S1CFG_MODE0_POSN                     equ 0000h
PWM2S1CFG_MODE0_POSITION                 equ 0000h
PWM2S1CFG_MODE0_SIZE                     equ 0001h
PWM2S1CFG_MODE0_LENGTH                   equ 0001h
PWM2S1CFG_MODE0_MASK                     equ 0001h
PWM2S1CFG_MODE1_POSN                     equ 0001h
PWM2S1CFG_MODE1_POSITION                 equ 0001h
PWM2S1CFG_MODE1_SIZE                     equ 0001h
PWM2S1CFG_MODE1_LENGTH                   equ 0001h
PWM2S1CFG_MODE1_MASK                     equ 0002h
PWM2S1CFG_MODE2_POSN                     equ 0002h
PWM2S1CFG_MODE2_POSITION                 equ 0002h
PWM2S1CFG_MODE2_SIZE                     equ 0001h
PWM2S1CFG_MODE2_LENGTH                   equ 0001h
PWM2S1CFG_MODE2_MASK                     equ 0004h

// Register: PWM2S1P1
#define PWM2S1P1 PWM2S1P1
PWM2S1P1                                 equ 047Ah

// Register: PWM2S1P1L
#define PWM2S1P1L PWM2S1P1L
PWM2S1P1L                                equ 047Ah
// bitfield definitions
PWM2S1P1L_S1P1L_POSN                     equ 0000h
PWM2S1P1L_S1P1L_POSITION                 equ 0000h
PWM2S1P1L_S1P1L_SIZE                     equ 0008h
PWM2S1P1L_S1P1L_LENGTH                   equ 0008h
PWM2S1P1L_S1P1L_MASK                     equ 00FFh

// Register: PWM2S1P1H
#define PWM2S1P1H PWM2S1P1H
PWM2S1P1H                                equ 047Bh
// bitfield definitions
PWM2S1P1H_S1P1H_POSN                     equ 0000h
PWM2S1P1H_S1P1H_POSITION                 equ 0000h
PWM2S1P1H_S1P1H_SIZE                     equ 0008h
PWM2S1P1H_S1P1H_LENGTH                   equ 0008h
PWM2S1P1H_S1P1H_MASK                     equ 00FFh

// Register: PWM2S1P2
#define PWM2S1P2 PWM2S1P2
PWM2S1P2                                 equ 047Ch

// Register: PWM2S1P2L
#define PWM2S1P2L PWM2S1P2L
PWM2S1P2L                                equ 047Ch
// bitfield definitions
PWM2S1P2L_S1P2L_POSN                     equ 0000h
PWM2S1P2L_S1P2L_POSITION                 equ 0000h
PWM2S1P2L_S1P2L_SIZE                     equ 0008h
PWM2S1P2L_S1P2L_LENGTH                   equ 0008h
PWM2S1P2L_S1P2L_MASK                     equ 00FFh

// Register: PWM2S1P2H
#define PWM2S1P2H PWM2S1P2H
PWM2S1P2H                                equ 047Dh
// bitfield definitions
PWM2S1P2H_S1P2H_POSN                     equ 0000h
PWM2S1P2H_S1P2H_POSITION                 equ 0000h
PWM2S1P2H_S1P2H_SIZE                     equ 0008h
PWM2S1P2H_S1P2H_LENGTH                   equ 0008h
PWM2S1P2H_S1P2H_MASK                     equ 00FFh

// Register: PWM3ERS
#define PWM3ERS PWM3ERS
PWM3ERS                                  equ 047Eh
// bitfield definitions
PWM3ERS_ERS_POSN                         equ 0000h
PWM3ERS_ERS_POSITION                     equ 0000h
PWM3ERS_ERS_SIZE                         equ 0008h
PWM3ERS_ERS_LENGTH                       equ 0008h
PWM3ERS_ERS_MASK                         equ 00FFh
PWM3ERS_ERS0_POSN                        equ 0000h
PWM3ERS_ERS0_POSITION                    equ 0000h
PWM3ERS_ERS0_SIZE                        equ 0001h
PWM3ERS_ERS0_LENGTH                      equ 0001h
PWM3ERS_ERS0_MASK                        equ 0001h
PWM3ERS_ERS1_POSN                        equ 0001h
PWM3ERS_ERS1_POSITION                    equ 0001h
PWM3ERS_ERS1_SIZE                        equ 0001h
PWM3ERS_ERS1_LENGTH                      equ 0001h
PWM3ERS_ERS1_MASK                        equ 0002h
PWM3ERS_ERS2_POSN                        equ 0002h
PWM3ERS_ERS2_POSITION                    equ 0002h
PWM3ERS_ERS2_SIZE                        equ 0001h
PWM3ERS_ERS2_LENGTH                      equ 0001h
PWM3ERS_ERS2_MASK                        equ 0004h
PWM3ERS_ERS3_POSN                        equ 0003h
PWM3ERS_ERS3_POSITION                    equ 0003h
PWM3ERS_ERS3_SIZE                        equ 0001h
PWM3ERS_ERS3_LENGTH                      equ 0001h
PWM3ERS_ERS3_MASK                        equ 0008h
PWM3ERS_ERS4_POSN                        equ 0004h
PWM3ERS_ERS4_POSITION                    equ 0004h
PWM3ERS_ERS4_SIZE                        equ 0001h
PWM3ERS_ERS4_LENGTH                      equ 0001h
PWM3ERS_ERS4_MASK                        equ 0010h
PWM3ERS_ERS5_POSN                        equ 0005h
PWM3ERS_ERS5_POSITION                    equ 0005h
PWM3ERS_ERS5_SIZE                        equ 0001h
PWM3ERS_ERS5_LENGTH                      equ 0001h
PWM3ERS_ERS5_MASK                        equ 0020h
PWM3ERS_ERS6_POSN                        equ 0006h
PWM3ERS_ERS6_POSITION                    equ 0006h
PWM3ERS_ERS6_SIZE                        equ 0001h
PWM3ERS_ERS6_LENGTH                      equ 0001h
PWM3ERS_ERS6_MASK                        equ 0040h
PWM3ERS_ERS7_POSN                        equ 0007h
PWM3ERS_ERS7_POSITION                    equ 0007h
PWM3ERS_ERS7_SIZE                        equ 0001h
PWM3ERS_ERS7_LENGTH                      equ 0001h
PWM3ERS_ERS7_MASK                        equ 0080h

// Register: PWM3CLK
#define PWM3CLK PWM3CLK
PWM3CLK                                  equ 047Fh
// bitfield definitions
PWM3CLK_CLK_POSN                         equ 0000h
PWM3CLK_CLK_POSITION                     equ 0000h
PWM3CLK_CLK_SIZE                         equ 0008h
PWM3CLK_CLK_LENGTH                       equ 0008h
PWM3CLK_CLK_MASK                         equ 00FFh
PWM3CLK_CLK0_POSN                        equ 0000h
PWM3CLK_CLK0_POSITION                    equ 0000h
PWM3CLK_CLK0_SIZE                        equ 0001h
PWM3CLK_CLK0_LENGTH                      equ 0001h
PWM3CLK_CLK0_MASK                        equ 0001h
PWM3CLK_CLK1_POSN                        equ 0001h
PWM3CLK_CLK1_POSITION                    equ 0001h
PWM3CLK_CLK1_SIZE                        equ 0001h
PWM3CLK_CLK1_LENGTH                      equ 0001h
PWM3CLK_CLK1_MASK                        equ 0002h
PWM3CLK_CLK2_POSN                        equ 0002h
PWM3CLK_CLK2_POSITION                    equ 0002h
PWM3CLK_CLK2_SIZE                        equ 0001h
PWM3CLK_CLK2_LENGTH                      equ 0001h
PWM3CLK_CLK2_MASK                        equ 0004h
PWM3CLK_CLK3_POSN                        equ 0003h
PWM3CLK_CLK3_POSITION                    equ 0003h
PWM3CLK_CLK3_SIZE                        equ 0001h
PWM3CLK_CLK3_LENGTH                      equ 0001h
PWM3CLK_CLK3_MASK                        equ 0008h
PWM3CLK_CLK4_POSN                        equ 0004h
PWM3CLK_CLK4_POSITION                    equ 0004h
PWM3CLK_CLK4_SIZE                        equ 0001h
PWM3CLK_CLK4_LENGTH                      equ 0001h
PWM3CLK_CLK4_MASK                        equ 0010h
PWM3CLK_CLK5_POSN                        equ 0005h
PWM3CLK_CLK5_POSITION                    equ 0005h
PWM3CLK_CLK5_SIZE                        equ 0001h
PWM3CLK_CLK5_LENGTH                      equ 0001h
PWM3CLK_CLK5_MASK                        equ 0020h
PWM3CLK_CLK6_POSN                        equ 0006h
PWM3CLK_CLK6_POSITION                    equ 0006h
PWM3CLK_CLK6_SIZE                        equ 0001h
PWM3CLK_CLK6_LENGTH                      equ 0001h
PWM3CLK_CLK6_MASK                        equ 0040h
PWM3CLK_CLK7_POSN                        equ 0007h
PWM3CLK_CLK7_POSITION                    equ 0007h
PWM3CLK_CLK7_SIZE                        equ 0001h
PWM3CLK_CLK7_LENGTH                      equ 0001h
PWM3CLK_CLK7_MASK                        equ 0080h

// Register: PWM3LDS
#define PWM3LDS PWM3LDS
PWM3LDS                                  equ 0480h
// bitfield definitions
PWM3LDS_LDS_POSN                         equ 0000h
PWM3LDS_LDS_POSITION                     equ 0000h
PWM3LDS_LDS_SIZE                         equ 0008h
PWM3LDS_LDS_LENGTH                       equ 0008h
PWM3LDS_LDS_MASK                         equ 00FFh
PWM3LDS_LDS0_POSN                        equ 0000h
PWM3LDS_LDS0_POSITION                    equ 0000h
PWM3LDS_LDS0_SIZE                        equ 0001h
PWM3LDS_LDS0_LENGTH                      equ 0001h
PWM3LDS_LDS0_MASK                        equ 0001h
PWM3LDS_LDS1_POSN                        equ 0001h
PWM3LDS_LDS1_POSITION                    equ 0001h
PWM3LDS_LDS1_SIZE                        equ 0001h
PWM3LDS_LDS1_LENGTH                      equ 0001h
PWM3LDS_LDS1_MASK                        equ 0002h
PWM3LDS_LDS2_POSN                        equ 0002h
PWM3LDS_LDS2_POSITION                    equ 0002h
PWM3LDS_LDS2_SIZE                        equ 0001h
PWM3LDS_LDS2_LENGTH                      equ 0001h
PWM3LDS_LDS2_MASK                        equ 0004h
PWM3LDS_LDS3_POSN                        equ 0003h
PWM3LDS_LDS3_POSITION                    equ 0003h
PWM3LDS_LDS3_SIZE                        equ 0001h
PWM3LDS_LDS3_LENGTH                      equ 0001h
PWM3LDS_LDS3_MASK                        equ 0008h
PWM3LDS_LDS4_POSN                        equ 0004h
PWM3LDS_LDS4_POSITION                    equ 0004h
PWM3LDS_LDS4_SIZE                        equ 0001h
PWM3LDS_LDS4_LENGTH                      equ 0001h
PWM3LDS_LDS4_MASK                        equ 0010h
PWM3LDS_LDS5_POSN                        equ 0005h
PWM3LDS_LDS5_POSITION                    equ 0005h
PWM3LDS_LDS5_SIZE                        equ 0001h
PWM3LDS_LDS5_LENGTH                      equ 0001h
PWM3LDS_LDS5_MASK                        equ 0020h
PWM3LDS_LDS6_POSN                        equ 0006h
PWM3LDS_LDS6_POSITION                    equ 0006h
PWM3LDS_LDS6_SIZE                        equ 0001h
PWM3LDS_LDS6_LENGTH                      equ 0001h
PWM3LDS_LDS6_MASK                        equ 0040h
PWM3LDS_LDS7_POSN                        equ 0007h
PWM3LDS_LDS7_POSITION                    equ 0007h
PWM3LDS_LDS7_SIZE                        equ 0001h
PWM3LDS_LDS7_LENGTH                      equ 0001h
PWM3LDS_LDS7_MASK                        equ 0080h

// Register: PWM3PR
#define PWM3PR PWM3PR
PWM3PR                                   equ 0481h

