GopalSaraf/Practicals/PSDL/include/proc/pic18f47q43.inc
// Register: PWM3S1P2
#define PWM3S1P2 PWM3S1P2
PWM3S1P2                                 equ 048Bh

// Register: PWM3S1P2L
#define PWM3S1P2L PWM3S1P2L
PWM3S1P2L                                equ 048Bh
// bitfield definitions
PWM3S1P2L_S1P2L_POSN                     equ 0000h
PWM3S1P2L_S1P2L_POSITION                 equ 0000h
PWM3S1P2L_S1P2L_SIZE                     equ 0008h
PWM3S1P2L_S1P2L_LENGTH                   equ 0008h
PWM3S1P2L_S1P2L_MASK                     equ 00FFh

// Register: PWM3S1P2H
#define PWM3S1P2H PWM3S1P2H
PWM3S1P2H                                equ 048Ch
// bitfield definitions
PWM3S1P2H_S1P2H_POSN                     equ 0000h
PWM3S1P2H_S1P2H_POSITION                 equ 0000h
PWM3S1P2H_S1P2H_SIZE                     equ 0008h
PWM3S1P2H_S1P2H_LENGTH                   equ 0008h
PWM3S1P2H_S1P2H_MASK                     equ 00FFh

// Register: PWMLOAD
#define PWMLOAD PWMLOAD
PWMLOAD                                  equ 049Ch
// bitfield definitions
PWMLOAD_MPWM1LD_POSN                     equ 0000h
PWMLOAD_MPWM1LD_POSITION                 equ 0000h
PWMLOAD_MPWM1LD_SIZE                     equ 0001h
PWMLOAD_MPWM1LD_LENGTH                   equ 0001h
PWMLOAD_MPWM1LD_MASK                     equ 0001h
PWMLOAD_MPWM2LD_POSN                     equ 0001h
PWMLOAD_MPWM2LD_POSITION                 equ 0001h
PWMLOAD_MPWM2LD_SIZE                     equ 0001h
PWMLOAD_MPWM2LD_LENGTH                   equ 0001h
PWMLOAD_MPWM2LD_MASK                     equ 0002h
PWMLOAD_MPWM3LD_POSN                     equ 0002h
PWMLOAD_MPWM3LD_POSITION                 equ 0002h
PWMLOAD_MPWM3LD_SIZE                     equ 0001h
PWMLOAD_MPWM3LD_LENGTH                   equ 0001h
PWMLOAD_MPWM3LD_MASK                     equ 0004h

// Register: PWMEN
#define PWMEN PWMEN
PWMEN                                    equ 049Dh
// bitfield definitions
PWMEN_MPWM1EN_POSN                       equ 0000h
PWMEN_MPWM1EN_POSITION                   equ 0000h
PWMEN_MPWM1EN_SIZE                       equ 0001h
PWMEN_MPWM1EN_LENGTH                     equ 0001h
PWMEN_MPWM1EN_MASK                       equ 0001h
PWMEN_MPWM2EN_POSN                       equ 0001h
PWMEN_MPWM2EN_POSITION                   equ 0001h
PWMEN_MPWM2EN_SIZE                       equ 0001h
PWMEN_MPWM2EN_LENGTH                     equ 0001h
PWMEN_MPWM2EN_MASK                       equ 0002h
PWMEN_MPWM3EN_POSN                       equ 0002h
PWMEN_MPWM3EN_POSITION                   equ 0002h
PWMEN_MPWM3EN_SIZE                       equ 0001h
PWMEN_MPWM3EN_LENGTH                     equ 0001h
PWMEN_MPWM3EN_MASK                       equ 0004h

// Register: PIE0
#define PIE0 PIE0
PIE0                                     equ 049Eh
// bitfield definitions
PIE0_SWIE_POSN                           equ 0000h
PIE0_SWIE_POSITION                       equ 0000h
PIE0_SWIE_SIZE                           equ 0001h
PIE0_SWIE_LENGTH                         equ 0001h
PIE0_SWIE_MASK                           equ 0001h
PIE0_HLVDIE_POSN                         equ 0001h
PIE0_HLVDIE_POSITION                     equ 0001h
PIE0_HLVDIE_SIZE                         equ 0001h
PIE0_HLVDIE_LENGTH                       equ 0001h
PIE0_HLVDIE_MASK                         equ 0002h
PIE0_OSFIE_POSN                          equ 0002h
PIE0_OSFIE_POSITION                      equ 0002h
PIE0_OSFIE_SIZE                          equ 0001h
PIE0_OSFIE_LENGTH                        equ 0001h
PIE0_OSFIE_MASK                          equ 0004h
PIE0_CSWIE_POSN                          equ 0003h
PIE0_CSWIE_POSITION                      equ 0003h
PIE0_CSWIE_SIZE                          equ 0001h
PIE0_CSWIE_LENGTH                        equ 0001h
PIE0_CSWIE_MASK                          equ 0008h
PIE0_CLC1IE_POSN                         equ 0005h
PIE0_CLC1IE_POSITION                     equ 0005h
PIE0_CLC1IE_SIZE                         equ 0001h
PIE0_CLC1IE_LENGTH                       equ 0001h
PIE0_CLC1IE_MASK                         equ 0020h
PIE0_IOCIE_POSN                          equ 0007h
PIE0_IOCIE_POSITION                      equ 0007h
PIE0_IOCIE_SIZE                          equ 0001h
PIE0_IOCIE_LENGTH                        equ 0001h
PIE0_IOCIE_MASK                          equ 0080h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 049Fh
// bitfield definitions
PIE1_INT0IE_POSN                         equ 0000h
PIE1_INT0IE_POSITION                     equ 0000h
PIE1_INT0IE_SIZE                         equ 0001h
PIE1_INT0IE_LENGTH                       equ 0001h
PIE1_INT0IE_MASK                         equ 0001h
PIE1_ZCDIE_POSN                          equ 0001h
PIE1_ZCDIE_POSITION                      equ 0001h
PIE1_ZCDIE_SIZE                          equ 0001h
PIE1_ZCDIE_LENGTH                        equ 0001h
PIE1_ZCDIE_MASK                          equ 0002h
PIE1_ADIE_POSN                           equ 0002h
PIE1_ADIE_POSITION                       equ 0002h
PIE1_ADIE_SIZE                           equ 0001h
PIE1_ADIE_LENGTH                         equ 0001h
PIE1_ADIE_MASK                           equ 0004h
PIE1_ACTIE_POSN                          equ 0003h
PIE1_ACTIE_POSITION                      equ 0003h
PIE1_ACTIE_SIZE                          equ 0001h
PIE1_ACTIE_LENGTH                        equ 0001h
PIE1_ACTIE_MASK                          equ 0008h
PIE1_C1IE_POSN                           equ 0004h
PIE1_C1IE_POSITION                       equ 0004h
PIE1_C1IE_SIZE                           equ 0001h
PIE1_C1IE_LENGTH                         equ 0001h
PIE1_C1IE_MASK                           equ 0010h
PIE1_SMT1IE_POSN                         equ 0005h
PIE1_SMT1IE_POSITION                     equ 0005h
PIE1_SMT1IE_SIZE                         equ 0001h
PIE1_SMT1IE_LENGTH                       equ 0001h
PIE1_SMT1IE_MASK                         equ 0020h
PIE1_SMT1PRAIE_POSN                      equ 0006h
PIE1_SMT1PRAIE_POSITION                  equ 0006h
PIE1_SMT1PRAIE_SIZE                      equ 0001h
PIE1_SMT1PRAIE_LENGTH                    equ 0001h
PIE1_SMT1PRAIE_MASK                      equ 0040h
PIE1_SMT1PWAIE_POSN                      equ 0007h
PIE1_SMT1PWAIE_POSITION                  equ 0007h
PIE1_SMT1PWAIE_SIZE                      equ 0001h
PIE1_SMT1PWAIE_LENGTH                    equ 0001h
PIE1_SMT1PWAIE_MASK                      equ 0080h

// Register: PIE2
#define PIE2 PIE2
PIE2                                     equ 04A0h
// bitfield definitions
PIE2_ADTIE_POSN                          equ 0000h
PIE2_ADTIE_POSITION                      equ 0000h
PIE2_ADTIE_SIZE                          equ 0001h
PIE2_ADTIE_LENGTH                        equ 0001h
PIE2_ADTIE_MASK                          equ 0001h
PIE2_DMA1SCNTIE_POSN                     equ 0004h
PIE2_DMA1SCNTIE_POSITION                 equ 0004h
PIE2_DMA1SCNTIE_SIZE                     equ 0001h
PIE2_DMA1SCNTIE_LENGTH                   equ 0001h
PIE2_DMA1SCNTIE_MASK                     equ 0010h
PIE2_DMA1DCNTIE_POSN                     equ 0005h
PIE2_DMA1DCNTIE_POSITION                 equ 0005h
PIE2_DMA1DCNTIE_SIZE                     equ 0001h
PIE2_DMA1DCNTIE_LENGTH                   equ 0001h
PIE2_DMA1DCNTIE_MASK                     equ 0020h
PIE2_DMA1ORIE_POSN                       equ 0006h
PIE2_DMA1ORIE_POSITION                   equ 0006h
PIE2_DMA1ORIE_SIZE                       equ 0001h
PIE2_DMA1ORIE_LENGTH                     equ 0001h
PIE2_DMA1ORIE_MASK                       equ 0040h
PIE2_DMA1AIE_POSN                        equ 0007h
PIE2_DMA1AIE_POSITION                    equ 0007h
PIE2_DMA1AIE_SIZE                        equ 0001h
PIE2_DMA1AIE_LENGTH                      equ 0001h
PIE2_DMA1AIE_MASK                        equ 0080h

// Register: PIE3
#define PIE3 PIE3
PIE3                                     equ 04A1h
// bitfield definitions
PIE3_SPI1RXIE_POSN                       equ 0000h
PIE3_SPI1RXIE_POSITION                   equ 0000h
PIE3_SPI1RXIE_SIZE                       equ 0001h
PIE3_SPI1RXIE_LENGTH                     equ 0001h
PIE3_SPI1RXIE_MASK                       equ 0001h
PIE3_SPI1TXIE_POSN                       equ 0001h
PIE3_SPI1TXIE_POSITION                   equ 0001h
PIE3_SPI1TXIE_SIZE                       equ 0001h
PIE3_SPI1TXIE_LENGTH                     equ 0001h
PIE3_SPI1TXIE_MASK                       equ 0002h
PIE3_SPI1IE_POSN                         equ 0002h
PIE3_SPI1IE_POSITION                     equ 0002h
PIE3_SPI1IE_SIZE                         equ 0001h
PIE3_SPI1IE_LENGTH                       equ 0001h
PIE3_SPI1IE_MASK                         equ 0004h
PIE3_TMR2IE_POSN                         equ 0003h
PIE3_TMR2IE_POSITION                     equ 0003h
PIE3_TMR2IE_SIZE                         equ 0001h
PIE3_TMR2IE_LENGTH                       equ 0001h
PIE3_TMR2IE_MASK                         equ 0008h
PIE3_TMR1IE_POSN                         equ 0004h
PIE3_TMR1IE_POSITION                     equ 0004h
PIE3_TMR1IE_SIZE                         equ 0001h
PIE3_TMR1IE_LENGTH                       equ 0001h
PIE3_TMR1IE_MASK                         equ 0010h
PIE3_TMR1GIE_POSN                        equ 0005h
PIE3_TMR1GIE_POSITION                    equ 0005h
PIE3_TMR1GIE_SIZE                        equ 0001h
PIE3_TMR1GIE_LENGTH                      equ 0001h
PIE3_TMR1GIE_MASK                        equ 0020h
PIE3_CCP1IE_POSN                         equ 0006h
PIE3_CCP1IE_POSITION                     equ 0006h
PIE3_CCP1IE_SIZE                         equ 0001h
PIE3_CCP1IE_LENGTH                       equ 0001h
PIE3_CCP1IE_MASK                         equ 0040h
PIE3_TMR0IE_POSN                         equ 0007h
PIE3_TMR0IE_POSITION                     equ 0007h
PIE3_TMR0IE_SIZE                         equ 0001h
PIE3_TMR0IE_LENGTH                       equ 0001h
PIE3_TMR0IE_MASK                         equ 0080h

