GopalSaraf/Practicals/PSDL/include/proc/pic18f47q43.inc
// Register: PORTD
#define PORTD PORTD
PORTD                                    equ 04D1h
// bitfield definitions
PORTD_RD0_POSN                           equ 0000h
PORTD_RD0_POSITION                       equ 0000h
PORTD_RD0_SIZE                           equ 0001h
PORTD_RD0_LENGTH                         equ 0001h
PORTD_RD0_MASK                           equ 0001h
PORTD_RD1_POSN                           equ 0001h
PORTD_RD1_POSITION                       equ 0001h
PORTD_RD1_SIZE                           equ 0001h
PORTD_RD1_LENGTH                         equ 0001h
PORTD_RD1_MASK                           equ 0002h
PORTD_RD2_POSN                           equ 0002h
PORTD_RD2_POSITION                       equ 0002h
PORTD_RD2_SIZE                           equ 0001h
PORTD_RD2_LENGTH                         equ 0001h
PORTD_RD2_MASK                           equ 0004h
PORTD_RD3_POSN                           equ 0003h
PORTD_RD3_POSITION                       equ 0003h
PORTD_RD3_SIZE                           equ 0001h
PORTD_RD3_LENGTH                         equ 0001h
PORTD_RD3_MASK                           equ 0008h
PORTD_RD4_POSN                           equ 0004h
PORTD_RD4_POSITION                       equ 0004h
PORTD_RD4_SIZE                           equ 0001h
PORTD_RD4_LENGTH                         equ 0001h
PORTD_RD4_MASK                           equ 0010h
PORTD_RD5_POSN                           equ 0005h
PORTD_RD5_POSITION                       equ 0005h
PORTD_RD5_SIZE                           equ 0001h
PORTD_RD5_LENGTH                         equ 0001h
PORTD_RD5_MASK                           equ 0020h
PORTD_RD6_POSN                           equ 0006h
PORTD_RD6_POSITION                       equ 0006h
PORTD_RD6_SIZE                           equ 0001h
PORTD_RD6_LENGTH                         equ 0001h
PORTD_RD6_MASK                           equ 0040h
PORTD_RD7_POSN                           equ 0007h
PORTD_RD7_POSITION                       equ 0007h
PORTD_RD7_SIZE                           equ 0001h
PORTD_RD7_LENGTH                         equ 0001h
PORTD_RD7_MASK                           equ 0080h

// Register: PORTE
#define PORTE PORTE
PORTE                                    equ 04D2h
// bitfield definitions
PORTE_RE0_POSN                           equ 0000h
PORTE_RE0_POSITION                       equ 0000h
PORTE_RE0_SIZE                           equ 0001h
PORTE_RE0_LENGTH                         equ 0001h
PORTE_RE0_MASK                           equ 0001h
PORTE_RE1_POSN                           equ 0001h
PORTE_RE1_POSITION                       equ 0001h
PORTE_RE1_SIZE                           equ 0001h
PORTE_RE1_LENGTH                         equ 0001h
PORTE_RE1_MASK                           equ 0002h
PORTE_RE2_POSN                           equ 0002h
PORTE_RE2_POSITION                       equ 0002h
PORTE_RE2_SIZE                           equ 0001h
PORTE_RE2_LENGTH                         equ 0001h
PORTE_RE2_MASK                           equ 0004h
PORTE_RE3_POSN                           equ 0003h
PORTE_RE3_POSITION                       equ 0003h
PORTE_RE3_SIZE                           equ 0001h
PORTE_RE3_LENGTH                         equ 0001h
PORTE_RE3_MASK                           equ 0008h

// Register: INTCON0
#define INTCON0 INTCON0
INTCON0                                  equ 04D6h
// bitfield definitions
INTCON0_INT0EDG_POSN                     equ 0000h
INTCON0_INT0EDG_POSITION                 equ 0000h
INTCON0_INT0EDG_SIZE                     equ 0001h
INTCON0_INT0EDG_LENGTH                   equ 0001h
INTCON0_INT0EDG_MASK                     equ 0001h
INTCON0_INT1EDG_POSN                     equ 0001h
INTCON0_INT1EDG_POSITION                 equ 0001h
INTCON0_INT1EDG_SIZE                     equ 0001h
INTCON0_INT1EDG_LENGTH                   equ 0001h
INTCON0_INT1EDG_MASK                     equ 0002h
INTCON0_INT2EDG_POSN                     equ 0002h
INTCON0_INT2EDG_POSITION                 equ 0002h
INTCON0_INT2EDG_SIZE                     equ 0001h
INTCON0_INT2EDG_LENGTH                   equ 0001h
INTCON0_INT2EDG_MASK                     equ 0004h
INTCON0_IPEN_POSN                        equ 0005h
INTCON0_IPEN_POSITION                    equ 0005h
INTCON0_IPEN_SIZE                        equ 0001h
INTCON0_IPEN_LENGTH                      equ 0001h
INTCON0_IPEN_MASK                        equ 0020h
INTCON0_GIEL_POSN                        equ 0006h
INTCON0_GIEL_POSITION                    equ 0006h
INTCON0_GIEL_SIZE                        equ 0001h
INTCON0_GIEL_LENGTH                      equ 0001h
INTCON0_GIEL_MASK                        equ 0040h
INTCON0_GIE_POSN                         equ 0007h
INTCON0_GIE_POSITION                     equ 0007h
INTCON0_GIE_SIZE                         equ 0001h
INTCON0_GIE_LENGTH                       equ 0001h
INTCON0_GIE_MASK                         equ 0080h
INTCON0_GIEH_POSN                        equ 0007h
INTCON0_GIEH_POSITION                    equ 0007h
INTCON0_GIEH_SIZE                        equ 0001h
INTCON0_GIEH_LENGTH                      equ 0001h
INTCON0_GIEH_MASK                        equ 0080h

// Register: INTCON1
#define INTCON1 INTCON1
INTCON1                                  equ 04D7h
// bitfield definitions
INTCON1_STAT_POSN                        equ 0006h
INTCON1_STAT_POSITION                    equ 0006h
INTCON1_STAT_SIZE                        equ 0002h
INTCON1_STAT_LENGTH                      equ 0002h
INTCON1_STAT_MASK                        equ 00C0h
INTCON1_STAT0_POSN                       equ 0006h
INTCON1_STAT0_POSITION                   equ 0006h
INTCON1_STAT0_SIZE                       equ 0001h
INTCON1_STAT0_LENGTH                     equ 0001h
INTCON1_STAT0_MASK                       equ 0040h
INTCON1_STAT1_POSN                       equ 0007h
INTCON1_STAT1_POSITION                   equ 0007h
INTCON1_STAT1_SIZE                       equ 0001h
INTCON1_STAT1_LENGTH                     equ 0001h
INTCON1_STAT1_MASK                       equ 0080h

// Register: STATUS
#define STATUS STATUS
STATUS                                   equ 04D8h
// bitfield definitions
STATUS_NOT_PD_POSN                       equ 0005h
STATUS_NOT_PD_POSITION                   equ 0005h
STATUS_NOT_PD_SIZE                       equ 0001h
STATUS_NOT_PD_LENGTH                     equ 0001h
STATUS_NOT_PD_MASK                       equ 0020h
STATUS_NOT_TO_POSN                       equ 0006h
STATUS_NOT_TO_POSITION                   equ 0006h
STATUS_NOT_TO_SIZE                       equ 0001h
STATUS_NOT_TO_LENGTH                     equ 0001h
STATUS_NOT_TO_MASK                       equ 0040h
STATUS_C_POSN                            equ 0000h
STATUS_C_POSITION                        equ 0000h
STATUS_C_SIZE                            equ 0001h
STATUS_C_LENGTH                          equ 0001h
STATUS_C_MASK                            equ 0001h
STATUS_DC_POSN                           equ 0001h
STATUS_DC_POSITION                       equ 0001h
STATUS_DC_SIZE                           equ 0001h
STATUS_DC_LENGTH                         equ 0001h
STATUS_DC_MASK                           equ 0002h
STATUS_Z_POSN                            equ 0002h
STATUS_Z_POSITION                        equ 0002h
STATUS_Z_SIZE                            equ 0001h
STATUS_Z_LENGTH                          equ 0001h
STATUS_Z_MASK                            equ 0004h
STATUS_OV_POSN                           equ 0003h
STATUS_OV_POSITION                       equ 0003h
STATUS_OV_SIZE                           equ 0001h
STATUS_OV_LENGTH                         equ 0001h
STATUS_OV_MASK                           equ 0008h
STATUS_N_POSN                            equ 0004h
STATUS_N_POSITION                        equ 0004h
STATUS_N_SIZE                            equ 0001h
STATUS_N_LENGTH                          equ 0001h
STATUS_N_MASK                            equ 0010h
STATUS_nPD_POSN                          equ 0005h
STATUS_nPD_POSITION                      equ 0005h
STATUS_nPD_SIZE                          equ 0001h
STATUS_nPD_LENGTH                        equ 0001h
STATUS_nPD_MASK                          equ 0020h
STATUS_nTO_POSN                          equ 0006h
STATUS_nTO_POSITION                      equ 0006h
STATUS_nTO_SIZE                          equ 0001h
STATUS_nTO_LENGTH                        equ 0001h
STATUS_nTO_MASK                          equ 0040h
STATUS_PD_POSN                           equ 0005h
STATUS_PD_POSITION                       equ 0005h
STATUS_PD_SIZE                           equ 0001h
STATUS_PD_LENGTH                         equ 0001h
STATUS_PD_MASK                           equ 0020h
STATUS_TO_POSN                           equ 0006h
STATUS_TO_POSITION                       equ 0006h
STATUS_TO_SIZE                           equ 0001h
STATUS_TO_LENGTH                         equ 0001h
STATUS_TO_MASK                           equ 0040h

// Register: FSR2
#define FSR2 FSR2
FSR2                                     equ 04D9h

// Register: FSR2L
#define FSR2L FSR2L
FSR2L                                    equ 04D9h
// bitfield definitions
FSR2L_FSR2L_POSN                         equ 0000h
FSR2L_FSR2L_POSITION                     equ 0000h
FSR2L_FSR2L_SIZE                         equ 0008h
FSR2L_FSR2L_LENGTH                       equ 0008h
FSR2L_FSR2L_MASK                         equ 00FFh

// Register: FSR2H
#define FSR2H FSR2H
FSR2H                                    equ 04DAh

// Register: PLUSW2
#define PLUSW2 PLUSW2
PLUSW2                                   equ 04DBh
// bitfield definitions
PLUSW2_PLUSW2_POSN                       equ 0000h
PLUSW2_PLUSW2_POSITION                   equ 0000h
PLUSW2_PLUSW2_SIZE                       equ 0008h
PLUSW2_PLUSW2_LENGTH                     equ 0008h
PLUSW2_PLUSW2_MASK                       equ 00FFh

// Register: PREINC2
#define PREINC2 PREINC2
PREINC2                                  equ 04DCh
// bitfield definitions
PREINC2_PREINC2_POSN                     equ 0000h
PREINC2_PREINC2_POSITION                 equ 0000h
PREINC2_PREINC2_SIZE                     equ 0008h
PREINC2_PREINC2_LENGTH                   equ 0008h
PREINC2_PREINC2_MASK                     equ 00FFh

// Register: POSTDEC2
#define POSTDEC2 POSTDEC2
POSTDEC2                                 equ 04DDh
// bitfield definitions
POSTDEC2_POSTDEC2_POSN                   equ 0000h
POSTDEC2_POSTDEC2_POSITION               equ 0000h
POSTDEC2_POSTDEC2_SIZE                   equ 0008h
POSTDEC2_POSTDEC2_LENGTH                 equ 0008h
POSTDEC2_POSTDEC2_MASK                   equ 00FFh

// Register: POSTINC2
#define POSTINC2 POSTINC2
POSTINC2                                 equ 04DEh
// bitfield definitions
POSTINC2_POSTINC2_POSN                   equ 0000h
POSTINC2_POSTINC2_POSITION               equ 0000h
POSTINC2_POSTINC2_SIZE                   equ 0008h
POSTINC2_POSTINC2_LENGTH                 equ 0008h
POSTINC2_POSTINC2_MASK                   equ 00FFh

// Register: INDF2
#define INDF2 INDF2
INDF2                                    equ 04DFh
// bitfield definitions
INDF2_INDF2_POSN                         equ 0000h
INDF2_INDF2_POSITION                     equ 0000h
INDF2_INDF2_SIZE                         equ 0008h
INDF2_INDF2_LENGTH                       equ 0008h
INDF2_INDF2_MASK                         equ 00FFh

